Contents of the .debug_abbrev section:

  Number TAG (0)
   1      DW_TAG_compile_unit    [has children]
    DW_AT_producer     DW_FORM_strp
    DW_AT_language     DW_FORM_data2
    DW_AT_name         DW_FORM_strp
    DW_AT_stmt_list    DW_FORM_sec_offset
    DW_AT_comp_dir     DW_FORM_strp
    DW_AT_low_pc       DW_FORM_addr
    DW_AT_ranges       DW_FORM_sec_offset
    DW_AT value: 0     DW_FORM value: 0
   2      DW_TAG_variable    [no children]
    DW_AT_name         DW_FORM_strp
    DW_AT_type         DW_FORM_ref4
    DW_AT_external     DW_FORM_flag_present
    DW_AT_decl_file    DW_FORM_data1
    DW_AT_decl_line    DW_FORM_data1
    DW_AT_location     DW_FORM_exprloc
    DW_AT value: 0     DW_FORM value: 0
   3      DW_TAG_typedef    [no children]
    DW_AT_type         DW_FORM_ref4
    DW_AT_name         DW_FORM_strp
    DW_AT_decl_file    DW_FORM_data1
    DW_AT_decl_line    DW_FORM_data1
    DW_AT value: 0     DW_FORM value: 0
   4      DW_TAG_base_type    [no children]
    DW_AT_name         DW_FORM_strp
    DW_AT_encoding     DW_FORM_data1
    DW_AT_byte_size    DW_FORM_data1
    DW_AT value: 0     DW_FORM value: 0
   5      DW_TAG_array_type    [has children]
    DW_AT_type         DW_FORM_ref4
    DW_AT value: 0     DW_FORM value: 0
   6      DW_TAG_subrange_type    [no children]
    DW_AT_type         DW_FORM_ref4
    DW_AT_count        DW_FORM_data1
    DW_AT value: 0     DW_FORM value: 0
   7      DW_TAG_const_type    [no children]

    DW_AT_decl_column  DW_FORM_data1
    DW_AT_prototyped   DW_FORM_flag_present
    DW_AT_type         DW_FORM_ref4
    DW_AT_low_pc       DW_FORM_addr
    DW_AT_high_pc      DW_FORM_data4
    DW_AT_frame_base   DW_FORM_exprloc
    DW_AT_call_all_calls DW_FORM_flag_present
    DW_AT value: 0     DW_FORM value: 0
   12      DW_TAG_formal_parameter    [no children]
    DW_AT_name         DW_FORM_strp
    DW_AT_decl_file    DW_FORM_data1
    DW_AT_decl_line    DW_FORM_data1
    DW_AT_decl_column  DW_FORM_data1
    DW_AT_type         DW_FORM_ref4
    DW_AT_location     DW_FORM_exprloc
    DW_AT value: 0     DW_FORM value: 0
   13      DW_TAG_variable    [no children]
    DW_AT_name         DW_FORM_strp
    DW_AT_decl_file    DW_FORM_data1
    DW_AT_decl_line    DW_FORM_data1
    DW_AT_decl_column  DW_FORM_data1
    DW_AT_type         DW_FORM_ref4
    DW_AT_location     DW_FORM_sec_offset
    DW_AT_GNU_locviews DW_FORM_sec_offset
    DW_AT value: 0     DW_FORM value: 0
  Number TAG (0x169f)
   1      DW_TAG_compile_unit    [has children]
    DW_AT_stmt_list    DW_FORM_sec_offset
    DW_AT_low_pc       DW_FORM_addr
    DW_AT_high_pc      DW_FORM_udata
    DW_AT_name         DW_FORM_strp
    DW_AT_comp_dir     DW_FORM_strp
    DW_AT_producer     DW_FORM_strp
    DW_AT_language     DW_FORM_data2
    DW_AT value: 0     DW_FORM value: 0
   2      DW_TAG_subprogram    [no children]
    DW_AT_name         DW_FORM_strp
    DW_AT_external     DW_FORM_flag_present
    DW_AT_type         DW_FORM_ref_udata
    DW_AT_low_pc       DW_FORM_addr
    DW_AT_high_pc      DW_FORM_udata
    DW_AT value: 0     DW_FORM value: 0
   3      DW_TAG_unspecified_type    [no children]
    DW_AT value: 0     DW_FORM value: 0

Contents of the .debug_info section:

  Compilation Unit @ offset 0:
   Length:        0xa8a (32-bit)
   Version:       4
   Abbrev Offset: 0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0): STMicroelectronics Arm Clang Toolchain --  clang version 19.1.6
    <10>   DW_AT_language    : 29	(C11)
    <12>   DW_AT_name        : (indirect string, offset: 0x40): /home/liaohy/User/Code/Stm32CubeMX/CLionDemo/Core/Src/system_stm32h7xx.c
    <16>   DW_AT_stmt_list   : 0
    <1a>   DW_AT_comp_dir    : (indirect string, offset: 0x89): /home/liaohy/User/Code/Stm32CubeMX/CLionDemo/build
    <1e>   DW_AT_low_pc      : 0
    <22>   DW_AT_ranges      : 0
 <1><26>: Abbrev Number: 2 (DW_TAG_variable)
    <27>   DW_AT_name        : (indirect string, offset: 0xbc): SystemCoreClock
    <2b>   DW_AT_type        : <0x37>
    <2f>   DW_AT_external    : 1
    <2f>   DW_AT_decl_file   : 3
    <30>   DW_AT_decl_line   : 153
    <31>   DW_AT_location    : 5 byte block: 3 0 0 0 20 	(DW_OP_addr: 20000000)
 <1><37>: Abbrev Number: 3 (DW_TAG_typedef)
    <38>   DW_AT_type        : <0x42>
    <3c>   DW_AT_name        : (indirect string, offset: 0xce): uint32_t
    <40>   DW_AT_decl_file   : 2
    <41>   DW_AT_decl_line   : 48
 <1><42>: Abbrev Number: 3 (DW_TAG_typedef)
    <43>   DW_AT_type        : <0x4d>
    <47>   DW_AT_name        : (indirect string, offset: 0xcc): __uint32_t
    <4b>   DW_AT_decl_file   : 1
    <4c>   DW_AT_decl_line   : 79
 <1><4d>: Abbrev Number: 4 (DW_TAG_base_type)
    <4e>   DW_AT_name        : (indirect string, offset: 0x5813): unsigned int
    <52>   DW_AT_encoding    : 7	(unsigned)
    <53>   DW_AT_byte_size   : 4
 <1><54>: Abbrev Number: 2 (DW_TAG_variable)
    <55>   DW_AT_name        : (indirect string, offset: 0xd7): SystemD2Clock
    <59>   DW_AT_type        : <0x37>
    <5d>   DW_AT_external    : 1
    <5d>   DW_AT_decl_file   : 3
    <5e>   DW_AT_decl_line   : 154
    <5f>   DW_AT_location    : 5 byte block: 3 4 0 0 20 	(DW_OP_addr: 20000004)
 <1><65>: Abbrev Number: 2 (DW_TAG_variable)
    <66>   DW_AT_name        : (indirect string, offset: 0xe5): D1CorePrescTable
    <6a>   DW_AT_type        : <0x76>
    <6e>   DW_AT_external    : 1
    <6e>   DW_AT_decl_file   : 3
    <6f>   DW_AT_decl_line   : 155
    <70>   DW_AT_location    : 5 byte block: 3 58 3f 0 8 	(DW_OP_addr: 8003f58)
 <1><76>: Abbrev Number: 5 (DW_TAG_array_type)
    <77>   DW_AT_type        : <0x82>
 <2><7b>: Abbrev Number: 6 (DW_TAG_subrange_type)
    <7c>   DW_AT_type        : <0xa4>
    <80>   DW_AT_count       : 16
 <2><81>: Abbrev Number: 0
 <1><82>: Abbrev Number: 7 (DW_TAG_const_type)
    <83>   DW_AT_type        : <0x87>
 <1><87>: Abbrev Number: 3 (DW_TAG_typedef)
    <88>   DW_AT_type        : <0x92>
    <8c>   DW_AT_name        : (indirect string, offset: 0x106): uint8_t
    <90>   DW_AT_decl_file   : 2
    <91>   DW_AT_decl_line   : 24
 <1><92>: Abbrev Number: 3 (DW_TAG_typedef)
    <93>   DW_AT_type        : <0x9d>
    <97>   DW_AT_name        : (indirect string, offset: 0x104): __uint8_t
    <9b>   DW_AT_decl_file   : 1
    <9c>   DW_AT_decl_line   : 43
 <1><9d>: Abbrev Number: 4 (DW_TAG_base_type)
    <9e>   DW_AT_name        : (indirect string, offset: 0xf6): unsigned char
    <a2>   DW_AT_encoding    : 8	(unsigned char)
    <a3>   DW_AT_byte_size   : 1
 <1><a4>: Abbrev Number: 8 (DW_TAG_base_type)
    <a5>   DW_AT_name        : (indirect string, offset: 0x10e): __ARRAY_SIZE_TYPE__
    <a9>   DW_AT_byte_size   : 8
    <aa>   DW_AT_encoding    : 7	(unsigned)
 <1><ab>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <ac>   DW_AT_type        : <0xb0>
 <1><b0>: Abbrev Number: 10 (DW_TAG_typedef)
    <b1>   DW_AT_type        : <0xbc>
    <b5>   DW_AT_name        : (indirect string, offset: 0x266): SCB_Type
    <b9>   DW_AT_decl_file   : 4
    <ba>   DW_AT_decl_line   : 507
 <1><bc>: Abbrev Number: 11 (DW_TAG_structure_type)
    <bd>   DW_AT_byte_size   : 684
    <bf>   DW_AT_decl_file   : 4
    <c0>   DW_AT_decl_line   : 455
 <2><c2>: Abbrev Number: 12 (DW_TAG_member)
    <c3>   DW_AT_name        : (indirect string, offset: 0x11a3): CPUID
    <c7>   DW_AT_type        : <0x365>
    <cb>   DW_AT_decl_file   : 4
    <cc>   DW_AT_decl_line   : 457
    <ce>   DW_AT_data_member_location: 0
 <2><cf>: Abbrev Number: 12 (DW_TAG_member)
    <d0>   DW_AT_name        : (indirect string, offset: 0x122): ICSR
    <d4>   DW_AT_type        : <0x36a>
    <d8>   DW_AT_decl_file   : 4
    <d9>   DW_AT_decl_line   : 458
    <db>   DW_AT_data_member_location: 4
 <2><dc>: Abbrev Number: 12 (DW_TAG_member)
    <dd>   DW_AT_name        : (indirect string, offset: 0x127): VTOR
    <e1>   DW_AT_type        : <0x36a>
    <e5>   DW_AT_decl_file   : 4
    <e6>   DW_AT_decl_line   : 459
    <e8>   DW_AT_data_member_location: 8
 <2><e9>: Abbrev Number: 12 (DW_TAG_member)
    <ea>   DW_AT_name        : (indirect string, offset: 0x12c): AIRCR
    <ee>   DW_AT_type        : <0x36a>
    <f2>   DW_AT_decl_file   : 4
    <f3>   DW_AT_decl_line   : 460
    <f5>   DW_AT_data_member_location: 12
 <2><f6>: Abbrev Number: 12 (DW_TAG_member)
    <f7>   DW_AT_name        : (indirect string, offset: 0x252): SCR
    <fb>   DW_AT_type        : <0x36a>
    <ff>   DW_AT_decl_file   : 4
    <100>   DW_AT_decl_line   : 461
    <102>   DW_AT_data_member_location: 16
 <2><103>: Abbrev Number: 12 (DW_TAG_member)
    <104>   DW_AT_name        : (indirect string, offset: 0x21d1): CCR
    <108>   DW_AT_type        : <0x36a>
    <10c>   DW_AT_decl_file   : 4
    <10d>   DW_AT_decl_line   : 462
    <10f>   DW_AT_data_member_location: 20
 <2><110>: Abbrev Number: 12 (DW_TAG_member)
    <111>   DW_AT_name        : (indirect string, offset: 0x132): SHPR
    <115>   DW_AT_type        : <0x36f>
    <119>   DW_AT_decl_file   : 4
    <11a>   DW_AT_decl_line   : 463
    <11c>   DW_AT_data_member_location: 24
 <2><11d>: Abbrev Number: 12 (DW_TAG_member)
    <11e>   DW_AT_name        : (indirect string, offset: 0x137): SHCSR
    <122>   DW_AT_type        : <0x36a>
    <126>   DW_AT_decl_file   : 4
    <127>   DW_AT_decl_line   : 464
    <129>   DW_AT_data_member_location: 36
 <2><12a>: Abbrev Number: 12 (DW_TAG_member)
    <12b>   DW_AT_name        : (indirect string, offset: 0x13d): CFSR
    <12f>   DW_AT_type        : <0x36a>
    <133>   DW_AT_decl_file   : 4
    <134>   DW_AT_decl_line   : 465
    <136>   DW_AT_data_member_location: 40
 <2><137>: Abbrev Number: 12 (DW_TAG_member)
    <138>   DW_AT_name        : (indirect string, offset: 0x142): HFSR
    <13c>   DW_AT_type        : <0x36a>
    <140>   DW_AT_decl_file   : 4
    <141>   DW_AT_decl_line   : 466
    <143>   DW_AT_data_member_location: 44
 <2><144>: Abbrev Number: 12 (DW_TAG_member)
    <145>   DW_AT_name        : (indirect string, offset: 0x147): DFSR
    <149>   DW_AT_type        : <0x36a>
    <14d>   DW_AT_decl_file   : 4
    <14e>   DW_AT_decl_line   : 467
    <150>   DW_AT_data_member_location: 48
 <2><151>: Abbrev Number: 12 (DW_TAG_member)
    <152>   DW_AT_name        : (indirect string, offset: 0x14c): MMFAR
    <156>   DW_AT_type        : <0x36a>
    <15a>   DW_AT_decl_file   : 4
    <15b>   DW_AT_decl_line   : 468
    <15d>   DW_AT_data_member_location: 52
 <2><15e>: Abbrev Number: 12 (DW_TAG_member)
    <15f>   DW_AT_name        : (indirect string, offset: 0x152): BFAR
    <163>   DW_AT_type        : <0x36a>
    <167>   DW_AT_decl_file   : 4
    <168>   DW_AT_decl_line   : 469
    <16a>   DW_AT_data_member_location: 56
 <2><16b>: Abbrev Number: 12 (DW_TAG_member)
    <16c>   DW_AT_name        : (indirect string, offset: 0x157): AFSR
    <170>   DW_AT_type        : <0x36a>
    <174>   DW_AT_decl_file   : 4
    <175>   DW_AT_decl_line   : 470
    <177>   DW_AT_data_member_location: 60
 <2><178>: Abbrev Number: 12 (DW_TAG_member)
    <179>   DW_AT_name        : (indirect string, offset: 0x15c): ID_PFR
    <17d>   DW_AT_type        : <0x380>
    <181>   DW_AT_decl_file   : 4
    <182>   DW_AT_decl_line   : 471
    <184>   DW_AT_data_member_location: 64
 <2><185>: Abbrev Number: 12 (DW_TAG_member)
    <186>   DW_AT_name        : (indirect string, offset: 0x163): ID_DFR
    <18a>   DW_AT_type        : <0x365>
    <18e>   DW_AT_decl_file   : 4
    <18f>   DW_AT_decl_line   : 472
    <191>   DW_AT_data_member_location: 72
 <2><192>: Abbrev Number: 12 (DW_TAG_member)
    <193>   DW_AT_name        : (indirect string, offset: 0x16a): ID_AFR
    <197>   DW_AT_type        : <0x365>
    <19b>   DW_AT_decl_file   : 4
    <19c>   DW_AT_decl_line   : 473
    <19e>   DW_AT_data_member_location: 76
 <2><19f>: Abbrev Number: 12 (DW_TAG_member)
    <1a0>   DW_AT_name        : (indirect string, offset: 0x171): ID_MFR
    <1a4>   DW_AT_type        : <0x38c>
    <1a8>   DW_AT_decl_file   : 4
    <1a9>   DW_AT_decl_line   : 474
    <1ab>   DW_AT_data_member_location: 80
 <2><1ac>: Abbrev Number: 12 (DW_TAG_member)
    <1ad>   DW_AT_name        : (indirect string, offset: 0x178): ID_ISAR
    <1b1>   DW_AT_type        : <0x398>
    <1b5>   DW_AT_decl_file   : 4
    <1b6>   DW_AT_decl_line   : 475
    <1b8>   DW_AT_data_member_location: 96
 <2><1b9>: Abbrev Number: 12 (DW_TAG_member)
    <1ba>   DW_AT_name        : (indirect string, offset: 0x180): RESERVED0
    <1be>   DW_AT_type        : <0x3a4>
    <1c2>   DW_AT_decl_file   : 4
    <1c3>   DW_AT_decl_line   : 476
    <1c5>   DW_AT_data_member_location: 116
 <2><1c6>: Abbrev Number: 12 (DW_TAG_member)
    <1c7>   DW_AT_name        : (indirect string, offset: 0x18a): CLIDR
    <1cb>   DW_AT_type        : <0x365>
    <1cf>   DW_AT_decl_file   : 4
    <1d0>   DW_AT_decl_line   : 477
    <1d2>   DW_AT_data_member_location: 120
 <2><1d3>: Abbrev Number: 12 (DW_TAG_member)
    <1d4>   DW_AT_name        : (indirect string, offset: 0x190): CTR
    <1d8>   DW_AT_type        : <0x365>
    <1dc>   DW_AT_decl_file   : 4
    <1dd>   DW_AT_decl_line   : 478
    <1df>   DW_AT_data_member_location: 124
 <2><1e0>: Abbrev Number: 12 (DW_TAG_member)
    <1e1>   DW_AT_name        : (indirect string, offset: 0x194): CCSIDR
    <1e5>   DW_AT_type        : <0x365>
    <1e9>   DW_AT_decl_file   : 4
    <1ea>   DW_AT_decl_line   : 479
    <1ec>   DW_AT_data_member_location: 128
 <2><1ed>: Abbrev Number: 12 (DW_TAG_member)
    <1ee>   DW_AT_name        : (indirect string, offset: 0x19b): CSSELR
    <1f2>   DW_AT_type        : <0x36a>
    <1f6>   DW_AT_decl_file   : 4
    <1f7>   DW_AT_decl_line   : 480
    <1f9>   DW_AT_data_member_location: 132
 <2><1fa>: Abbrev Number: 12 (DW_TAG_member)
    <1fb>   DW_AT_name        : (indirect string, offset: 0x1a2): CPACR
    <1ff>   DW_AT_type        : <0x36a>
    <203>   DW_AT_decl_file   : 4
    <204>   DW_AT_decl_line   : 481
    <206>   DW_AT_data_member_location: 136
 <2><207>: Abbrev Number: 12 (DW_TAG_member)
    <208>   DW_AT_name        : (indirect string, offset: 0x1a8): RESERVED3
    <20c>   DW_AT_type        : <0x3b0>
    <210>   DW_AT_decl_file   : 4
    <211>   DW_AT_decl_line   : 482
    <213>   DW_AT_data_member_location: 140
 <2><214>: Abbrev Number: 13 (DW_TAG_member)
    <215>   DW_AT_name        : (indirect string, offset: 0x1b2): STIR
    <219>   DW_AT_type        : <0x36a>
    <21d>   DW_AT_decl_file   : 4
    <21e>   DW_AT_decl_line   : 483
    <220>   DW_AT_data_member_location: 512
 <2><222>: Abbrev Number: 13 (DW_TAG_member)
    <223>   DW_AT_name        : (indirect string, offset: 0x1b7): RESERVED4
    <227>   DW_AT_type        : <0x3bc>
    <22b>   DW_AT_decl_file   : 4
    <22c>   DW_AT_decl_line   : 484
    <22e>   DW_AT_data_member_location: 516
 <2><230>: Abbrev Number: 13 (DW_TAG_member)
    <231>   DW_AT_name        : (indirect string, offset: 0x1c1): MVFR0
    <235>   DW_AT_type        : <0x365>
    <239>   DW_AT_decl_file   : 4
    <23a>   DW_AT_decl_line   : 485
    <23c>   DW_AT_data_member_location: 576
 <2><23e>: Abbrev Number: 13 (DW_TAG_member)
    <23f>   DW_AT_name        : (indirect string, offset: 0x1c7): MVFR1
    <243>   DW_AT_type        : <0x365>
    <247>   DW_AT_decl_file   : 4
    <248>   DW_AT_decl_line   : 486
    <24a>   DW_AT_data_member_location: 580
 <2><24c>: Abbrev Number: 13 (DW_TAG_member)
    <24d>   DW_AT_name        : (indirect string, offset: 0x1cd): MVFR2
    <251>   DW_AT_type        : <0x365>
    <255>   DW_AT_decl_file   : 4
    <256>   DW_AT_decl_line   : 487
    <258>   DW_AT_data_member_location: 584
 <2><25a>: Abbrev Number: 13 (DW_TAG_member)
    <25b>   DW_AT_name        : (indirect string, offset: 0x1d3): RESERVED5
    <25f>   DW_AT_type        : <0x3a4>
    <263>   DW_AT_decl_file   : 4
    <264>   DW_AT_decl_line   : 488
    <266>   DW_AT_data_member_location: 588
 <2><268>: Abbrev Number: 13 (DW_TAG_member)
    <269>   DW_AT_name        : (indirect string, offset: 0x1dd): ICIALLU
    <26d>   DW_AT_type        : <0x36a>
    <271>   DW_AT_decl_file   : 4
    <272>   DW_AT_decl_line   : 489
    <274>   DW_AT_data_member_location: 592
 <2><276>: Abbrev Number: 13 (DW_TAG_member)
    <277>   DW_AT_name        : (indirect string, offset: 0x1e5): RESERVED6
    <27b>   DW_AT_type        : <0x3a4>
    <27f>   DW_AT_decl_file   : 4
    <280>   DW_AT_decl_line   : 490
    <282>   DW_AT_data_member_location: 596
 <2><284>: Abbrev Number: 13 (DW_TAG_member)
    <285>   DW_AT_name        : (indirect string, offset: 0x1ef): ICIMVAU
    <289>   DW_AT_type        : <0x36a>
    <28d>   DW_AT_decl_file   : 4
    <28e>   DW_AT_decl_line   : 491
    <290>   DW_AT_data_member_location: 600
 <2><292>: Abbrev Number: 13 (DW_TAG_member)
    <293>   DW_AT_name        : (indirect string, offset: 0x1f7): DCIMVAC
    <297>   DW_AT_type        : <0x36a>
    <29b>   DW_AT_decl_file   : 4
    <29c>   DW_AT_decl_line   : 492
    <29e>   DW_AT_data_member_location: 604
 <2><2a0>: Abbrev Number: 13 (DW_TAG_member)
    <2a1>   DW_AT_name        : (indirect string, offset: 0x1ff): DCISW
    <2a5>   DW_AT_type        : <0x36a>
    <2a9>   DW_AT_decl_file   : 4
    <2aa>   DW_AT_decl_line   : 493
    <2ac>   DW_AT_data_member_location: 608
 <2><2ae>: Abbrev Number: 13 (DW_TAG_member)
    <2af>   DW_AT_name        : (indirect string, offset: 0x205): DCCMVAU
    <2b3>   DW_AT_type        : <0x36a>
    <2b7>   DW_AT_decl_file   : 4
    <2b8>   DW_AT_decl_line   : 494
    <2ba>   DW_AT_data_member_location: 612
 <2><2bc>: Abbrev Number: 13 (DW_TAG_member)
    <2bd>   DW_AT_name        : (indirect string, offset: 0x20d): DCCMVAC
    <2c1>   DW_AT_type        : <0x36a>
    <2c5>   DW_AT_decl_file   : 4
    <2c6>   DW_AT_decl_line   : 495
    <2c8>   DW_AT_data_member_location: 616
 <2><2ca>: Abbrev Number: 13 (DW_TAG_member)
    <2cb>   DW_AT_name        : (indirect string, offset: 0x215): DCCSW
    <2cf>   DW_AT_type        : <0x36a>
    <2d3>   DW_AT_decl_file   : 4
    <2d4>   DW_AT_decl_line   : 496
    <2d6>   DW_AT_data_member_location: 620
 <2><2d8>: Abbrev Number: 13 (DW_TAG_member)
    <2d9>   DW_AT_name        : (indirect string, offset: 0x21b): DCCIMVAC
    <2dd>   DW_AT_type        : <0x36a>
    <2e1>   DW_AT_decl_file   : 4
    <2e2>   DW_AT_decl_line   : 497
    <2e4>   DW_AT_data_member_location: 624
 <2><2e6>: Abbrev Number: 13 (DW_TAG_member)
    <2e7>   DW_AT_name        : (indirect string, offset: 0x224): DCCISW
    <2eb>   DW_AT_type        : <0x36a>
    <2ef>   DW_AT_decl_file   : 4
    <2f0>   DW_AT_decl_line   : 498
    <2f2>   DW_AT_data_member_location: 628
 <2><2f4>: Abbrev Number: 13 (DW_TAG_member)
    <2f5>   DW_AT_name        : (indirect string, offset: 0x22b): RESERVED7
    <2f9>   DW_AT_type        : <0x3c8>
    <2fd>   DW_AT_decl_file   : 4
    <2fe>   DW_AT_decl_line   : 499
    <300>   DW_AT_data_member_location: 632
 <2><302>: Abbrev Number: 13 (DW_TAG_member)
    <303>   DW_AT_name        : (indirect string, offset: 0x235): ITCMCR
    <307>   DW_AT_type        : <0x36a>
    <30b>   DW_AT_decl_file   : 4
    <30c>   DW_AT_decl_line   : 500
    <30e>   DW_AT_data_member_location: 656
 <2><310>: Abbrev Number: 13 (DW_TAG_member)
    <311>   DW_AT_name        : (indirect string, offset: 0x23c): DTCMCR
    <315>   DW_AT_type        : <0x36a>
    <319>   DW_AT_decl_file   : 4
    <31a>   DW_AT_decl_line   : 501
    <31c>   DW_AT_data_member_location: 660
 <2><31e>: Abbrev Number: 13 (DW_TAG_member)
    <31f>   DW_AT_name        : (indirect string, offset: 0x243): AHBPCR
    <323>   DW_AT_type        : <0x36a>
    <327>   DW_AT_decl_file   : 4
    <328>   DW_AT_decl_line   : 502
    <32a>   DW_AT_data_member_location: 664
 <2><32c>: Abbrev Number: 13 (DW_TAG_member)
    <32d>   DW_AT_name        : (indirect string, offset: 0x24a): CACR
    <331>   DW_AT_type        : <0x36a>
    <335>   DW_AT_decl_file   : 4
    <336>   DW_AT_decl_line   : 503
    <338>   DW_AT_data_member_location: 668
 <2><33a>: Abbrev Number: 13 (DW_TAG_member)
    <33b>   DW_AT_name        : (indirect string, offset: 0x24f): AHBSCR
    <33f>   DW_AT_type        : <0x36a>
    <343>   DW_AT_decl_file   : 4
    <344>   DW_AT_decl_line   : 504
    <346>   DW_AT_data_member_location: 672
 <2><348>: Abbrev Number: 13 (DW_TAG_member)
    <349>   DW_AT_name        : (indirect string, offset: 0x256): RESERVED8
    <34d>   DW_AT_type        : <0x3a4>
    <351>   DW_AT_decl_file   : 4
    <352>   DW_AT_decl_line   : 505
    <354>   DW_AT_data_member_location: 676
 <2><356>: Abbrev Number: 13 (DW_TAG_member)
    <357>   DW_AT_name        : (indirect string, offset: 0x260): ABFSR
    <35b>   DW_AT_type        : <0x36a>
    <35f>   DW_AT_decl_file   : 4
    <360>   DW_AT_decl_line   : 506
    <362>   DW_AT_data_member_location: 680
 <2><364>: Abbrev Number: 0
 <1><365>: Abbrev Number: 7 (DW_TAG_const_type)
    <366>   DW_AT_type        : <0x36a>
 <1><36a>: Abbrev Number: 14 (DW_TAG_volatile_type)
    <36b>   DW_AT_type        : <0x37>
 <1><36f>: Abbrev Number: 5 (DW_TAG_array_type)
    <370>   DW_AT_type        : <0x37b>
 <2><374>: Abbrev Number: 6 (DW_TAG_subrange_type)
    <375>   DW_AT_type        : <0xa4>
    <379>   DW_AT_count       : 12
 <2><37a>: Abbrev Number: 0
 <1><37b>: Abbrev Number: 14 (DW_TAG_volatile_type)
    <37c>   DW_AT_type        : <0x87>
 <1><380>: Abbrev Number: 5 (DW_TAG_array_type)
    <381>   DW_AT_type        : <0x365>
 <2><385>: Abbrev Number: 6 (DW_TAG_subrange_type)
    <386>   DW_AT_type        : <0xa4>
    <38a>   DW_AT_count       : 2
 <2><38b>: Abbrev Number: 0
 <1><38c>: Abbrev Number: 5 (DW_TAG_array_type)
    <38d>   DW_AT_type        : <0x365>
 <2><391>: Abbrev Number: 6 (DW_TAG_subrange_type)
    <392>   DW_AT_type        : <0xa4>
    <396>   DW_AT_count       : 4
 <2><397>: Abbrev Number: 0
 <1><398>: Abbrev Number: 5 (DW_TAG_array_type)
    <399>   DW_AT_type        : <0x365>
 <2><39d>: Abbrev Number: 6 (DW_TAG_subrange_type)
    <39e>   DW_AT_type        : <0xa4>
    <3a2>   DW_AT_count       : 5
 <2><3a3>: Abbrev Number: 0
 <1><3a4>: Abbrev Number: 5 (DW_TAG_array_type)
    <3a5>   DW_AT_type        : <0x37>
 <2><3a9>: Abbrev Number: 6 (DW_TAG_subrange_type)
    <3aa>   DW_AT_type        : <0xa4>
    <3ae>   DW_AT_count       : 1
 <2><3af>: Abbrev Number: 0
 <1><3b0>: Abbrev Number: 5 (DW_TAG_array_type)
    <3b1>   DW_AT_type        : <0x37>
 <2><3b5>: Abbrev Number: 6 (DW_TAG_subrange_type)
    <3b6>   DW_AT_type        : <0xa4>
    <3ba>   DW_AT_count       : 93
 <2><3bb>: Abbrev Number: 0
 <1><3bc>: Abbrev Number: 5 (DW_TAG_array_type)
    <3bd>   DW_AT_type        : <0x37>
 <2><3c1>: Abbrev Number: 6 (DW_TAG_subrange_type)
    <3c2>   DW_AT_type        : <0xa4>
    <3c6>   DW_AT_count       : 15
 <2><3c7>: Abbrev Number: 0
 <1><3c8>: Abbrev Number: 5 (DW_TAG_array_type)
    <3c9>   DW_AT_type        : <0x37>
 <2><3cd>: Abbrev Number: 6 (DW_TAG_subrange_type)
    <3ce>   DW_AT_type        : <0xa4>
    <3d2>   DW_AT_count       : 6
 <2><3d3>: Abbrev Number: 0
 <1><3d4>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <3d5>   DW_AT_type        : <0x3d9>
 <1><3d9>: Abbrev Number: 10 (DW_TAG_typedef)
    <3da>   DW_AT_type        : <0x3e5>
    <3de>   DW_AT_name        : (indirect string, offset: 0x334): FLASH_TypeDef
    <3e2>   DW_AT_decl_file   : 5
    <3e3>   DW_AT_decl_line   : 984
 <1><3e5>: Abbrev Number: 15 (DW_TAG_structure_type)
    <3e6>   DW_AT_byte_size   : 120
    <3e7>   DW_AT_decl_file   : 5
    <3e8>   DW_AT_decl_line   : 955
 <2><3ea>: Abbrev Number: 12 (DW_TAG_member)
    <3eb>   DW_AT_name        : (indirect string, offset: 0x24b): ACR
    <3ef>   DW_AT_type        : <0x36a>
    <3f3>   DW_AT_decl_file   : 5
    <3f4>   DW_AT_decl_line   : 957
    <3f6>   DW_AT_data_member_location: 0
 <2><3f7>: Abbrev Number: 12 (DW_TAG_member)
    <3f8>   DW_AT_name        : (indirect string, offset: 0x26f): KEYR1
    <3fc>   DW_AT_type        : <0x36a>
    <400>   DW_AT_decl_file   : 5
    <401>   DW_AT_decl_line   : 958
    <403>   DW_AT_data_member_location: 4
 <2><404>: Abbrev Number: 12 (DW_TAG_member)
    <405>   DW_AT_name        : (indirect string, offset: 0x275): OPTKEYR
    <409>   DW_AT_type        : <0x36a>
    <40d>   DW_AT_decl_file   : 5
    <40e>   DW_AT_decl_line   : 959
    <410>   DW_AT_data_member_location: 8
 <2><411>: Abbrev Number: 12 (DW_TAG_member)
    <412>   DW_AT_name        : (indirect string, offset: 0x2ef): CR1
    <416>   DW_AT_type        : <0x36a>
    <41a>   DW_AT_decl_file   : 5
    <41b>   DW_AT_decl_line   : 960
    <41d>   DW_AT_data_member_location: 12
 <2><41e>: Abbrev Number: 12 (DW_TAG_member)
    <41f>   DW_AT_name        : (indirect string, offset: 0x55c): SR1
    <423>   DW_AT_type        : <0x36a>
    <427>   DW_AT_decl_file   : 5
    <428>   DW_AT_decl_line   : 961
    <42a>   DW_AT_data_member_location: 16
 <2><42b>: Abbrev Number: 12 (DW_TAG_member)
    <42c>   DW_AT_name        : (indirect string, offset: 0x2ee): CCR1
    <430>   DW_AT_type        : <0x36a>
    <434>   DW_AT_decl_file   : 5
    <435>   DW_AT_decl_line   : 962
    <437>   DW_AT_data_member_location: 20
 <2><438>: Abbrev Number: 12 (DW_TAG_member)
    <439>   DW_AT_name        : (indirect string, offset: 0x27d): OPTCR
    <43d>   DW_AT_type        : <0x36a>
    <441>   DW_AT_decl_file   : 5
    <442>   DW_AT_decl_line   : 963
    <444>   DW_AT_data_member_location: 24
 <2><445>: Abbrev Number: 12 (DW_TAG_member)
    <446>   DW_AT_name        : (indirect string, offset: 0x283): OPTSR_CUR
    <44a>   DW_AT_type        : <0x36a>
    <44e>   DW_AT_decl_file   : 5
    <44f>   DW_AT_decl_line   : 964
    <451>   DW_AT_data_member_location: 28
 <2><452>: Abbrev Number: 12 (DW_TAG_member)
    <453>   DW_AT_name        : (indirect string, offset: 0x28d): OPTSR_PRG
    <457>   DW_AT_type        : <0x36a>
    <45b>   DW_AT_decl_file   : 5
    <45c>   DW_AT_decl_line   : 965
    <45e>   DW_AT_data_member_location: 32
 <2><45f>: Abbrev Number: 12 (DW_TAG_member)
    <460>   DW_AT_name        : (indirect string, offset: 0x297): OPTCCR
    <464>   DW_AT_type        : <0x36a>
    <468>   DW_AT_decl_file   : 5
    <469>   DW_AT_decl_line   : 966
    <46b>   DW_AT_data_member_location: 36
 <2><46c>: Abbrev Number: 12 (DW_TAG_member)
    <46d>   DW_AT_name        : (indirect string, offset: 0x29e): PRAR_CUR1
    <471>   DW_AT_type        : <0x36a>
    <475>   DW_AT_decl_file   : 5
    <476>   DW_AT_decl_line   : 967
    <478>   DW_AT_data_member_location: 40
 <2><479>: Abbrev Number: 12 (DW_TAG_member)
    <47a>   DW_AT_name        : (indirect string, offset: 0x2a8): PRAR_PRG1
    <47e>   DW_AT_type        : <0x36a>
    <482>   DW_AT_decl_file   : 5
    <483>   DW_AT_decl_line   : 968
    <485>   DW_AT_data_member_location: 44
 <2><486>: Abbrev Number: 12 (DW_TAG_member)
    <487>   DW_AT_name        : (indirect string, offset: 0x2b2): SCAR_CUR1
    <48b>   DW_AT_type        : <0x36a>
    <48f>   DW_AT_decl_file   : 5
    <490>   DW_AT_decl_line   : 969
    <492>   DW_AT_data_member_location: 48
 <2><493>: Abbrev Number: 12 (DW_TAG_member)
    <494>   DW_AT_name        : (indirect string, offset: 0x2bc): SCAR_PRG1
    <498>   DW_AT_type        : <0x36a>
    <49c>   DW_AT_decl_file   : 5
    <49d>   DW_AT_decl_line   : 970
    <49f>   DW_AT_data_member_location: 52
 <2><4a0>: Abbrev Number: 12 (DW_TAG_member)
    <4a1>   DW_AT_name        : (indirect string, offset: 0x2c6): WPSN_CUR1
    <4a5>   DW_AT_type        : <0x36a>
    <4a9>   DW_AT_decl_file   : 5
    <4aa>   DW_AT_decl_line   : 971
    <4ac>   DW_AT_data_member_location: 56
 <2><4ad>: Abbrev Number: 12 (DW_TAG_member)
    <4ae>   DW_AT_name        : (indirect string, offset: 0x2d0): WPSN_PRG1
    <4b2>   DW_AT_type        : <0x36a>
    <4b6>   DW_AT_decl_file   : 5
    <4b7>   DW_AT_decl_line   : 972
    <4b9>   DW_AT_data_member_location: 60
 <2><4ba>: Abbrev Number: 12 (DW_TAG_member)
    <4bb>   DW_AT_name        : (indirect string, offset: 0x2da): BOOT_CUR
    <4bf>   DW_AT_type        : <0x36a>
    <4c3>   DW_AT_decl_file   : 5
    <4c4>   DW_AT_decl_line   : 973
    <4c6>   DW_AT_data_member_location: 64
 <2><4c7>: Abbrev Number: 12 (DW_TAG_member)
    <4c8>   DW_AT_name        : (indirect string, offset: 0x2e3): BOOT_PRG
    <4cc>   DW_AT_type        : <0x36a>
    <4d0>   DW_AT_decl_file   : 5
    <4d1>   DW_AT_decl_line   : 974
    <4d3>   DW_AT_data_member_location: 68
 <2><4d4>: Abbrev Number: 12 (DW_TAG_member)
    <4d5>   DW_AT_name        : (indirect string, offset: 0x180): RESERVED0
    <4d9>   DW_AT_type        : <0x54a>
    <4dd>   DW_AT_decl_file   : 5
    <4de>   DW_AT_decl_line   : 975
    <4e0>   DW_AT_data_member_location: 72
 <2><4e1>: Abbrev Number: 12 (DW_TAG_member)
    <4e2>   DW_AT_name        : (indirect string, offset: 0x2ec): CRCCR1
    <4e6>   DW_AT_type        : <0x36a>
    <4ea>   DW_AT_decl_file   : 5
    <4eb>   DW_AT_decl_line   : 976
    <4ed>   DW_AT_data_member_location: 80
 <2><4ee>: Abbrev Number: 12 (DW_TAG_member)
    <4ef>   DW_AT_name        : (indirect string, offset: 0x2f3): CRCSADD1
    <4f3>   DW_AT_type        : <0x36a>
    <4f7>   DW_AT_decl_file   : 5
    <4f8>   DW_AT_decl_line   : 977
    <4fa>   DW_AT_data_member_location: 84
 <2><4fb>: Abbrev Number: 12 (DW_TAG_member)
    <4fc>   DW_AT_name        : (indirect string, offset: 0x2fc): CRCEADD1
    <500>   DW_AT_type        : <0x36a>
    <504>   DW_AT_decl_file   : 5
    <505>   DW_AT_decl_line   : 978
    <507>   DW_AT_data_member_location: 88
 <2><508>: Abbrev Number: 12 (DW_TAG_member)
    <509>   DW_AT_name        : (indirect string, offset: 0x305): CRCDATA
    <50d>   DW_AT_type        : <0x36a>
    <511>   DW_AT_decl_file   : 5
    <512>   DW_AT_decl_line   : 979
    <514>   DW_AT_data_member_location: 92
 <2><515>: Abbrev Number: 12 (DW_TAG_member)
    <516>   DW_AT_name        : (indirect string, offset: 0x30d): ECC_FA1
    <51a>   DW_AT_type        : <0x36a>
    <51e>   DW_AT_decl_file   : 5
    <51f>   DW_AT_decl_line   : 980
    <521>   DW_AT_data_member_location: 96
 <2><522>: Abbrev Number: 12 (DW_TAG_member)
    <523>   DW_AT_name        : (indirect string, offset: 0x315): RESERVED
    <527>   DW_AT_type        : <0x556>
    <52b>   DW_AT_decl_file   : 5
    <52c>   DW_AT_decl_line   : 981
    <52e>   DW_AT_data_member_location: 100
 <2><52f>: Abbrev Number: 12 (DW_TAG_member)
    <530>   DW_AT_name        : (indirect string, offset: 0x31e): OPTSR2_CUR
    <534>   DW_AT_type        : <0x36a>
    <538>   DW_AT_decl_file   : 5
    <539>   DW_AT_decl_line   : 982
    <53b>   DW_AT_data_member_location: 112
 <2><53c>: Abbrev Number: 12 (DW_TAG_member)
    <53d>   DW_AT_name        : (indirect string, offset: 0x329): OPTSR2_PRG
    <541>   DW_AT_type        : <0x36a>
    <545>   DW_AT_decl_file   : 5
    <546>   DW_AT_decl_line   : 983
    <548>   DW_AT_data_member_location: 116
 <2><549>: Abbrev Number: 0
 <1><54a>: Abbrev Number: 5 (DW_TAG_array_type)
    <54b>   DW_AT_type        : <0x37>
 <2><54f>: Abbrev Number: 6 (DW_TAG_subrange_type)
    <550>   DW_AT_type        : <0xa4>
    <554>   DW_AT_count       : 2
 <2><555>: Abbrev Number: 0
 <1><556>: Abbrev Number: 5 (DW_TAG_array_type)
    <557>   DW_AT_type        : <0x37>
 <2><55b>: Abbrev Number: 6 (DW_TAG_subrange_type)
    <55c>   DW_AT_type        : <0xa4>
    <560>   DW_AT_count       : 3
 <2><561>: Abbrev Number: 0
 <1><562>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <563>   DW_AT_type        : <0x567>
 <1><567>: Abbrev Number: 10 (DW_TAG_typedef)
    <568>   DW_AT_type        : <0x573>
    <56c>   DW_AT_name        : (indirect string, offset: 0x52a): RCC_TypeDef
    <570>   DW_AT_decl_file   : 5
    <571>   DW_AT_decl_line   : 1300
 <1><573>: Abbrev Number: 11 (DW_TAG_structure_type)
    <574>   DW_AT_byte_size   : 304
    <576>   DW_AT_decl_file   : 5
    <577>   DW_AT_decl_line   : 1232
 <2><579>: Abbrev Number: 12 (DW_TAG_member)
    <57a>   DW_AT_name        : (indirect string, offset: 0x570): CR
    <57e>   DW_AT_type        : <0x36a>
    <582>   DW_AT_decl_file   : 5
    <583>   DW_AT_decl_line   : 1234
    <585>   DW_AT_data_member_location: 0
 <2><586>: Abbrev Number: 12 (DW_TAG_member)
    <587>   DW_AT_name        : (indirect string, offset: 0x342): HSICFGR
    <58b>   DW_AT_type        : <0x36a>
    <58f>   DW_AT_decl_file   : 5
    <590>   DW_AT_decl_line   : 1235
    <592>   DW_AT_data_member_location: 4
 <2><593>: Abbrev Number: 12 (DW_TAG_member)
    <594>   DW_AT_name        : (indirect string, offset: 0x34a): CRRCR
    <598>   DW_AT_type        : <0x36a>
    <59c>   DW_AT_decl_file   : 5
    <59d>   DW_AT_decl_line   : 1236
    <59f>   DW_AT_data_member_location: 8
 <2><5a0>: Abbrev Number: 12 (DW_TAG_member)
    <5a1>   DW_AT_name        : (indirect string, offset: 0x350): CSICFGR
    <5a5>   DW_AT_type        : <0x36a>
    <5a9>   DW_AT_decl_file   : 5
    <5aa>   DW_AT_decl_line   : 1237
    <5ac>   DW_AT_data_member_location: 12
 <2><5ad>: Abbrev Number: 12 (DW_TAG_member)
    <5ae>   DW_AT_name        : (indirect string, offset: 0x364): CFGR
    <5b2>   DW_AT_type        : <0x36a>
    <5b6>   DW_AT_decl_file   : 5
    <5b7>   DW_AT_decl_line   : 1238
    <5b9>   DW_AT_data_member_location: 16
 <2><5ba>: Abbrev Number: 12 (DW_TAG_member)
    <5bb>   DW_AT_name        : (indirect string, offset: 0x358): RESERVED1
    <5bf>   DW_AT_type        : <0x37>
    <5c3>   DW_AT_decl_file   : 5
    <5c4>   DW_AT_decl_line   : 1239
    <5c6>   DW_AT_data_member_location: 20
 <2><5c7>: Abbrev Number: 12 (DW_TAG_member)
    <5c8>   DW_AT_name        : (indirect string, offset: 0x362): D1CFGR
    <5cc>   DW_AT_type        : <0x36a>
    <5d0>   DW_AT_decl_file   : 5
    <5d1>   DW_AT_decl_line   : 1240
    <5d3>   DW_AT_data_member_location: 24
 <2><5d4>: Abbrev Number: 12 (DW_TAG_member)
    <5d5>   DW_AT_name        : (indirect string, offset: 0x369): D2CFGR
    <5d9>   DW_AT_type        : <0x36a>
    <5dd>   DW_AT_decl_file   : 5
    <5de>   DW_AT_decl_line   : 1241
    <5e0>   DW_AT_data_member_location: 28
 <2><5e1>: Abbrev Number: 12 (DW_TAG_member)
    <5e2>   DW_AT_name        : (indirect string, offset: 0x370): D3CFGR
    <5e6>   DW_AT_type        : <0x36a>
    <5ea>   DW_AT_decl_file   : 5
    <5eb>   DW_AT_decl_line   : 1242
    <5ed>   DW_AT_data_member_location: 32
 <2><5ee>: Abbrev Number: 12 (DW_TAG_member)
    <5ef>   DW_AT_name        : (indirect string, offset: 0x377): RESERVED2
    <5f3>   DW_AT_type        : <0x37>
    <5f7>   DW_AT_decl_file   : 5
    <5f8>   DW_AT_decl_line   : 1243
    <5fa>   DW_AT_data_member_location: 36
 <2><5fb>: Abbrev Number: 12 (DW_TAG_member)
    <5fc>   DW_AT_name        : (indirect string, offset: 0x381): PLLCKSELR
    <600>   DW_AT_type        : <0x36a>
    <604>   DW_AT_decl_file   : 5
    <605>   DW_AT_decl_line   : 1244
    <607>   DW_AT_data_member_location: 40
 <2><608>: Abbrev Number: 12 (DW_TAG_member)
    <609>   DW_AT_name        : (indirect string, offset: 0x38b): PLLCFGR
    <60d>   DW_AT_type        : <0x36a>
    <611>   DW_AT_decl_file   : 5
    <612>   DW_AT_decl_line   : 1245
    <614>   DW_AT_data_member_location: 44
 <2><615>: Abbrev Number: 12 (DW_TAG_member)
    <616>   DW_AT_name        : (indirect string, offset: 0x393): PLL1DIVR
    <61a>   DW_AT_type        : <0x36a>
    <61e>   DW_AT_decl_file   : 5
    <61f>   DW_AT_decl_line   : 1246
    <621>   DW_AT_data_member_location: 48
 <2><622>: Abbrev Number: 12 (DW_TAG_member)
    <623>   DW_AT_name        : (indirect string, offset: 0x39c): PLL1FRACR
    <627>   DW_AT_type        : <0x36a>
    <62b>   DW_AT_decl_file   : 5
    <62c>   DW_AT_decl_line   : 1247
    <62e>   DW_AT_data_member_location: 52
 <2><62f>: Abbrev Number: 12 (DW_TAG_member)
    <630>   DW_AT_name        : (indirect string, offset: 0x3a6): PLL2DIVR
    <634>   DW_AT_type        : <0x36a>
    <638>   DW_AT_decl_file   : 5
    <639>   DW_AT_decl_line   : 1248
    <63b>   DW_AT_data_member_location: 56
 <2><63c>: Abbrev Number: 12 (DW_TAG_member)
    <63d>   DW_AT_name        : (indirect string, offset: 0x3af): PLL2FRACR
    <641>   DW_AT_type        : <0x36a>
    <645>   DW_AT_decl_file   : 5
    <646>   DW_AT_decl_line   : 1249
    <648>   DW_AT_data_member_location: 60
 <2><649>: Abbrev Number: 12 (DW_TAG_member)
    <64a>   DW_AT_name        : (indirect string, offset: 0x3b9): PLL3DIVR
    <64e>   DW_AT_type        : <0x36a>
    <652>   DW_AT_decl_file   : 5
    <653>   DW_AT_decl_line   : 1250
    <655>   DW_AT_data_member_location: 64
 <2><656>: Abbrev Number: 12 (DW_TAG_member)
    <657>   DW_AT_name        : (indirect string, offset: 0x3c2): PLL3FRACR
    <65b>   DW_AT_type        : <0x36a>
    <65f>   DW_AT_decl_file   : 5
    <660>   DW_AT_decl_line   : 1251
    <662>   DW_AT_data_member_location: 68
 <2><663>: Abbrev Number: 12 (DW_TAG_member)
    <664>   DW_AT_name        : (indirect string, offset: 0x1a8): RESERVED3
    <668>   DW_AT_type        : <0x37>
    <66c>   DW_AT_decl_file   : 5
    <66d>   DW_AT_decl_line   : 1252
    <66f>   DW_AT_data_member_location: 72
 <2><670>: Abbrev Number: 12 (DW_TAG_member)
    <671>   DW_AT_name        : (indirect string, offset: 0x3cc): D1CCIPR
    <675>   DW_AT_type        : <0x36a>
    <679>   DW_AT_decl_file   : 5
    <67a>   DW_AT_decl_line   : 1253
    <67c>   DW_AT_data_member_location: 76
 <2><67d>: Abbrev Number: 12 (DW_TAG_member)
    <67e>   DW_AT_name        : (indirect string, offset: 0x3d4): D2CCIP1R
    <682>   DW_AT_type        : <0x36a>
    <686>   DW_AT_decl_file   : 5
    <687>   DW_AT_decl_line   : 1254
    <689>   DW_AT_data_member_location: 80
 <2><68a>: Abbrev Number: 12 (DW_TAG_member)
    <68b>   DW_AT_name        : (indirect string, offset: 0x3dd): D2CCIP2R
    <68f>   DW_AT_type        : <0x36a>
    <693>   DW_AT_decl_file   : 5
    <694>   DW_AT_decl_line   : 1255
    <696>   DW_AT_data_member_location: 84
 <2><697>: Abbrev Number: 12 (DW_TAG_member)
    <698>   DW_AT_name        : (indirect string, offset: 0x3e6): D3CCIPR
    <69c>   DW_AT_type        : <0x36a>
    <6a0>   DW_AT_decl_file   : 5
    <6a1>   DW_AT_decl_line   : 1256
    <6a3>   DW_AT_data_member_location: 88
 <2><6a4>: Abbrev Number: 12 (DW_TAG_member)
    <6a5>   DW_AT_name        : (indirect string, offset: 0x1b7): RESERVED4
    <6a9>   DW_AT_type        : <0x37>
    <6ad>   DW_AT_decl_file   : 5
    <6ae>   DW_AT_decl_line   : 1257
    <6b0>   DW_AT_data_member_location: 92
 <2><6b1>: Abbrev Number: 12 (DW_TAG_member)
    <6b2>   DW_AT_name        : (indirect string, offset: 0x3ee): CIER
    <6b6>   DW_AT_type        : <0x36a>
    <6ba>   DW_AT_decl_file   : 5
    <6bb>   DW_AT_decl_line   : 1258
    <6bd>   DW_AT_data_member_location: 96
 <2><6be>: Abbrev Number: 12 (DW_TAG_member)
    <6bf>   DW_AT_name        : (indirect string, offset: 0x3f3): CIFR
    <6c3>   DW_AT_type        : <0x36a>
    <6c7>   DW_AT_decl_file   : 5
    <6c8>   DW_AT_decl_line   : 1259
    <6ca>   DW_AT_data_member_location: 100
 <2><6cb>: Abbrev Number: 12 (DW_TAG_member)
    <6cc>   DW_AT_name        : (indirect string, offset: 0x3f8): CICR
    <6d0>   DW_AT_type        : <0x36a>
    <6d4>   DW_AT_decl_file   : 5
    <6d5>   DW_AT_decl_line   : 1260
    <6d7>   DW_AT_data_member_location: 104
 <2><6d8>: Abbrev Number: 12 (DW_TAG_member)
    <6d9>   DW_AT_name        : (indirect string, offset: 0x1d3): RESERVED5
    <6dd>   DW_AT_type        : <0x37>
    <6e1>   DW_AT_decl_file   : 5
    <6e2>   DW_AT_decl_line   : 1261
    <6e4>   DW_AT_data_member_location: 108
 <2><6e5>: Abbrev Number: 12 (DW_TAG_member)
    <6e6>   DW_AT_name        : (indirect string, offset: 0x3fd): BDCR
    <6ea>   DW_AT_type        : <0x36a>
    <6ee>   DW_AT_decl_file   : 5
    <6ef>   DW_AT_decl_line   : 1262
    <6f1>   DW_AT_data_member_location: 112
 <2><6f2>: Abbrev Number: 12 (DW_TAG_member)
    <6f3>   DW_AT_name        : (indirect string, offset: 0x21c7): CSR
    <6f7>   DW_AT_type        : <0x36a>
    <6fb>   DW_AT_decl_file   : 5
    <6fc>   DW_AT_decl_line   : 1263
    <6fe>   DW_AT_data_member_location: 116
 <2><6ff>: Abbrev Number: 12 (DW_TAG_member)
    <700>   DW_AT_name        : (indirect string, offset: 0x1e5): RESERVED6
    <704>   DW_AT_type        : <0x37>
    <708>   DW_AT_decl_file   : 5
    <709>   DW_AT_decl_line   : 1264
    <70b>   DW_AT_data_member_location: 120
 <2><70c>: Abbrev Number: 12 (DW_TAG_member)
    <70d>   DW_AT_name        : (indirect string, offset: 0x402): AHB3RSTR
    <711>   DW_AT_type        : <0x36a>
    <715>   DW_AT_decl_file   : 5
    <716>   DW_AT_decl_line   : 1265
    <718>   DW_AT_data_member_location: 124
 <2><719>: Abbrev Number: 12 (DW_TAG_member)
    <71a>   DW_AT_name        : (indirect string, offset: 0x40b): AHB1RSTR
    <71e>   DW_AT_type        : <0x36a>
    <722>   DW_AT_decl_file   : 5
    <723>   DW_AT_decl_line   : 1266
    <725>   DW_AT_data_member_location: 128
 <2><726>: Abbrev Number: 12 (DW_TAG_member)
    <727>   DW_AT_name        : (indirect string, offset: 0x414): AHB2RSTR
    <72b>   DW_AT_type        : <0x36a>
    <72f>   DW_AT_decl_file   : 5
    <730>   DW_AT_decl_line   : 1267
    <732>   DW_AT_data_member_location: 132
 <2><733>: Abbrev Number: 12 (DW_TAG_member)
    <734>   DW_AT_name        : (indirect string, offset: 0x41d): AHB4RSTR
    <738>   DW_AT_type        : <0x36a>
    <73c>   DW_AT_decl_file   : 5
    <73d>   DW_AT_decl_line   : 1268
    <73f>   DW_AT_data_member_location: 136
 <2><740>: Abbrev Number: 12 (DW_TAG_member)
    <741>   DW_AT_name        : (indirect string, offset: 0x426): APB3RSTR
    <745>   DW_AT_type        : <0x36a>
    <749>   DW_AT_decl_file   : 5
    <74a>   DW_AT_decl_line   : 1269
    <74c>   DW_AT_data_member_location: 140
 <2><74d>: Abbrev Number: 12 (DW_TAG_member)
    <74e>   DW_AT_name        : (indirect string, offset: 0x42f): APB1LRSTR
    <752>   DW_AT_type        : <0x36a>
    <756>   DW_AT_decl_file   : 5
    <757>   DW_AT_decl_line   : 1270
    <759>   DW_AT_data_member_location: 144
 <2><75a>: Abbrev Number: 12 (DW_TAG_member)
    <75b>   DW_AT_name        : (indirect string, offset: 0x439): APB1HRSTR
    <75f>   DW_AT_type        : <0x36a>
    <763>   DW_AT_decl_file   : 5
    <764>   DW_AT_decl_line   : 1271
    <766>   DW_AT_data_member_location: 148
 <2><767>: Abbrev Number: 12 (DW_TAG_member)
    <768>   DW_AT_name        : (indirect string, offset: 0x443): APB2RSTR
    <76c>   DW_AT_type        : <0x36a>
    <770>   DW_AT_decl_file   : 5
    <771>   DW_AT_decl_line   : 1272
    <773>   DW_AT_data_member_location: 152
 <2><774>: Abbrev Number: 12 (DW_TAG_member)
    <775>   DW_AT_name        : (indirect string, offset: 0x44c): APB4RSTR
    <779>   DW_AT_type        : <0x36a>
    <77d>   DW_AT_decl_file   : 5
    <77e>   DW_AT_decl_line   : 1273
    <780>   DW_AT_data_member_location: 156
 <2><781>: Abbrev Number: 12 (DW_TAG_member)
    <782>   DW_AT_name        : (indirect string, offset: 0x455): GCR
    <786>   DW_AT_type        : <0x36a>
    <78a>   DW_AT_decl_file   : 5
    <78b>   DW_AT_decl_line   : 1274
    <78d>   DW_AT_data_member_location: 160
 <2><78e>: Abbrev Number: 12 (DW_TAG_member)
    <78f>   DW_AT_name        : (indirect string, offset: 0x256): RESERVED8
    <793>   DW_AT_type        : <0x37>
    <797>   DW_AT_decl_file   : 5
    <798>   DW_AT_decl_line   : 1275
    <79a>   DW_AT_data_member_location: 164
 <2><79b>: Abbrev Number: 12 (DW_TAG_member)
    <79c>   DW_AT_name        : (indirect string, offset: 0x459): D3AMR
    <7a0>   DW_AT_type        : <0x36a>
    <7a4>   DW_AT_decl_file   : 5
    <7a5>   DW_AT_decl_line   : 1276
    <7a7>   DW_AT_data_member_location: 168
 <2><7a8>: Abbrev Number: 12 (DW_TAG_member)
    <7a9>   DW_AT_name        : (indirect string, offset: 0x45f): RESERVED11
    <7ad>   DW_AT_type        : <0x8d0>
    <7b1>   DW_AT_decl_file   : 5
    <7b2>   DW_AT_decl_line   : 1277
    <7b4>   DW_AT_data_member_location: 172
 <2><7b5>: Abbrev Number: 12 (DW_TAG_member)
    <7b6>   DW_AT_name        : (indirect string, offset: 0x46a): RSR
    <7ba>   DW_AT_type        : <0x36a>
    <7be>   DW_AT_decl_file   : 5
    <7bf>   DW_AT_decl_line   : 1278
    <7c1>   DW_AT_data_member_location: 208
 <2><7c2>: Abbrev Number: 12 (DW_TAG_member)
    <7c3>   DW_AT_name        : (indirect string, offset: 0x46e): AHB3ENR
    <7c7>   DW_AT_type        : <0x36a>
    <7cb>   DW_AT_decl_file   : 5
    <7cc>   DW_AT_decl_line   : 1279
    <7ce>   DW_AT_data_member_location: 212
 <2><7cf>: Abbrev Number: 12 (DW_TAG_member)
    <7d0>   DW_AT_name        : (indirect string, offset: 0x476): AHB1ENR
    <7d4>   DW_AT_type        : <0x36a>
    <7d8>   DW_AT_decl_file   : 5
    <7d9>   DW_AT_decl_line   : 1280
    <7db>   DW_AT_data_member_location: 216
 <2><7dc>: Abbrev Number: 12 (DW_TAG_member)
    <7dd>   DW_AT_name        : (indirect string, offset: 0x47e): AHB2ENR
    <7e1>   DW_AT_type        : <0x36a>
    <7e5>   DW_AT_decl_file   : 5
    <7e6>   DW_AT_decl_line   : 1281
    <7e8>   DW_AT_data_member_location: 220
 <2><7e9>: Abbrev Number: 12 (DW_TAG_member)
    <7ea>   DW_AT_name        : (indirect string, offset: 0x486): AHB4ENR
    <7ee>   DW_AT_type        : <0x36a>
    <7f2>   DW_AT_decl_file   : 5
    <7f3>   DW_AT_decl_line   : 1282
    <7f5>   DW_AT_data_member_location: 224
 <2><7f6>: Abbrev Number: 12 (DW_TAG_member)
    <7f7>   DW_AT_name        : (indirect string, offset: 0x48e): APB3ENR
    <7fb>   DW_AT_type        : <0x36a>
    <7ff>   DW_AT_decl_file   : 5
    <800>   DW_AT_decl_line   : 1283
    <802>   DW_AT_data_member_location: 228
 <2><803>: Abbrev Number: 12 (DW_TAG_member)
    <804>   DW_AT_name        : (indirect string, offset: 0x496): APB1LENR
    <808>   DW_AT_type        : <0x36a>
    <80c>   DW_AT_decl_file   : 5
    <80d>   DW_AT_decl_line   : 1284
    <80f>   DW_AT_data_member_location: 232
 <2><810>: Abbrev Number: 12 (DW_TAG_member)
    <811>   DW_AT_name        : (indirect string, offset: 0x49f): APB1HENR
    <815>   DW_AT_type        : <0x36a>
    <819>   DW_AT_decl_file   : 5
    <81a>   DW_AT_decl_line   : 1285
    <81c>   DW_AT_data_member_location: 236
 <2><81d>: Abbrev Number: 12 (DW_TAG_member)
    <81e>   DW_AT_name        : (indirect string, offset: 0x4a8): APB2ENR
    <822>   DW_AT_type        : <0x36a>
    <826>   DW_AT_decl_file   : 5
    <827>   DW_AT_decl_line   : 1286
    <829>   DW_AT_data_member_location: 240
 <2><82a>: Abbrev Number: 12 (DW_TAG_member)
    <82b>   DW_AT_name        : (indirect string, offset: 0x4b0): APB4ENR
    <82f>   DW_AT_type        : <0x36a>
    <833>   DW_AT_decl_file   : 5
    <834>   DW_AT_decl_line   : 1287
    <836>   DW_AT_data_member_location: 244
 <2><837>: Abbrev Number: 12 (DW_TAG_member)
    <838>   DW_AT_name        : (indirect string, offset: 0x4b8): RESERVED12
    <83c>   DW_AT_type        : <0x37>
    <840>   DW_AT_decl_file   : 5
    <841>   DW_AT_decl_line   : 1288
    <843>   DW_AT_data_member_location: 248
 <2><844>: Abbrev Number: 12 (DW_TAG_member)
    <845>   DW_AT_name        : (indirect string, offset: 0x4c3): AHB3LPENR
    <849>   DW_AT_type        : <0x36a>
    <84d>   DW_AT_decl_file   : 5
    <84e>   DW_AT_decl_line   : 1289
    <850>   DW_AT_data_member_location: 252
 <2><851>: Abbrev Number: 13 (DW_TAG_member)
    <852>   DW_AT_name        : (indirect string, offset: 0x4cd): AHB1LPENR
    <856>   DW_AT_type        : <0x36a>
    <85a>   DW_AT_decl_file   : 5
    <85b>   DW_AT_decl_line   : 1290
    <85d>   DW_AT_data_member_location: 256
 <2><85f>: Abbrev Number: 13 (DW_TAG_member)
    <860>   DW_AT_name        : (indirect string, offset: 0x4d7): AHB2LPENR
    <864>   DW_AT_type        : <0x36a>
    <868>   DW_AT_decl_file   : 5
    <869>   DW_AT_decl_line   : 1291
    <86b>   DW_AT_data_member_location: 260
 <2><86d>: Abbrev Number: 13 (DW_TAG_member)
    <86e>   DW_AT_name        : (indirect string, offset: 0x4e1): AHB4LPENR
    <872>   DW_AT_type        : <0x36a>
    <876>   DW_AT_decl_file   : 5
    <877>   DW_AT_decl_line   : 1292
    <879>   DW_AT_data_member_location: 264
 <2><87b>: Abbrev Number: 13 (DW_TAG_member)
    <87c>   DW_AT_name        : (indirect string, offset: 0x4eb): APB3LPENR
    <880>   DW_AT_type        : <0x36a>
    <884>   DW_AT_decl_file   : 5
    <885>   DW_AT_decl_line   : 1293
    <887>   DW_AT_data_member_location: 268
 <2><889>: Abbrev Number: 13 (DW_TAG_member)
    <88a>   DW_AT_name        : (indirect string, offset: 0x4f5): APB1LLPENR
    <88e>   DW_AT_type        : <0x36a>
    <892>   DW_AT_decl_file   : 5
    <893>   DW_AT_decl_line   : 1294
    <895>   DW_AT_data_member_location: 272
 <2><897>: Abbrev Number: 13 (DW_TAG_member)
    <898>   DW_AT_name        : (indirect string, offset: 0x500): APB1HLPENR
    <89c>   DW_AT_type        : <0x36a>
    <8a0>   DW_AT_decl_file   : 5
    <8a1>   DW_AT_decl_line   : 1295
    <8a3>   DW_AT_data_member_location: 276
 <2><8a5>: Abbrev Number: 13 (DW_TAG_member)
    <8a6>   DW_AT_name        : (indirect string, offset: 0x50b): APB2LPENR
    <8aa>   DW_AT_type        : <0x36a>
    <8ae>   DW_AT_decl_file   : 5
    <8af>   DW_AT_decl_line   : 1296
    <8b1>   DW_AT_data_member_location: 280
 <2><8b3>: Abbrev Number: 13 (DW_TAG_member)
    <8b4>   DW_AT_name        : (indirect string, offset: 0x515): APB4LPENR
    <8b8>   DW_AT_type        : <0x36a>
    <8bc>   DW_AT_decl_file   : 5
    <8bd>   DW_AT_decl_line   : 1297
    <8bf>   DW_AT_data_member_location: 284
 <2><8c1>: Abbrev Number: 13 (DW_TAG_member)
    <8c2>   DW_AT_name        : (indirect string, offset: 0x51f): RESERVED13
    <8c6>   DW_AT_type        : <0x8dc>
    <8ca>   DW_AT_decl_file   : 5
    <8cb>   DW_AT_decl_line   : 1298
    <8cd>   DW_AT_data_member_location: 288
 <2><8cf>: Abbrev Number: 0
 <1><8d0>: Abbrev Number: 5 (DW_TAG_array_type)
    <8d1>   DW_AT_type        : <0x37>
 <2><8d5>: Abbrev Number: 6 (DW_TAG_subrange_type)
    <8d6>   DW_AT_type        : <0xa4>
    <8da>   DW_AT_count       : 9
 <2><8db>: Abbrev Number: 0
 <1><8dc>: Abbrev Number: 5 (DW_TAG_array_type)
    <8dd>   DW_AT_type        : <0x37>
 <2><8e1>: Abbrev Number: 6 (DW_TAG_subrange_type)
    <8e2>   DW_AT_type        : <0xa4>
    <8e6>   DW_AT_count       : 4
 <2><8e7>: Abbrev Number: 0
 <1><8e8>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <8e9>   DW_AT_type        : <0x8ed>
 <1><8ed>: Abbrev Number: 10 (DW_TAG_typedef)
    <8ee>   DW_AT_type        : <0x8f9>
    <8f2>   DW_AT_name        : (indirect string, offset: 0x53b): FMC_Bank1_TypeDef
    <8f6>   DW_AT_decl_file   : 5
    <8f7>   DW_AT_decl_line   : 1008
 <1><8f9>: Abbrev Number: 15 (DW_TAG_structure_type)
    <8fa>   DW_AT_byte_size   : 32
    <8fb>   DW_AT_decl_file   : 5
    <8fc>   DW_AT_decl_line   : 1005
 <2><8fe>: Abbrev Number: 12 (DW_TAG_member)
    <8ff>   DW_AT_name        : (indirect string, offset: 0x536): BTCR
    <903>   DW_AT_type        : <0x90c>
    <907>   DW_AT_decl_file   : 5
    <908>   DW_AT_decl_line   : 1007
    <90a>   DW_AT_data_member_location: 0
 <2><90b>: Abbrev Number: 0
 <1><90c>: Abbrev Number: 5 (DW_TAG_array_type)
    <90d>   DW_AT_type        : <0x36a>
 <2><911>: Abbrev Number: 6 (DW_TAG_subrange_type)
    <912>   DW_AT_type        : <0xa4>
    <916>   DW_AT_count       : 8
 <2><917>: Abbrev Number: 0
 <1><918>: Abbrev Number: 3 (DW_TAG_typedef)
    <919>   DW_AT_type        : <0x923>
    <91d>   DW_AT_name        : (indirect string, offset: 0x553): float_t
    <921>   DW_AT_decl_file   : 6
    <922>   DW_AT_decl_line   : 160
 <1><923>: Abbrev Number: 4 (DW_TAG_base_type)
    <924>   DW_AT_name        : (indirect string, offset: 0x54d): float
    <928>   DW_AT_encoding    : 4	(float)
    <929>   DW_AT_byte_size   : 4
 <1><92a>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <92b>   DW_AT_type        : <0x92f>
 <1><92f>: Abbrev Number: 10 (DW_TAG_typedef)
    <930>   DW_AT_type        : <0x93b>
    <934>   DW_AT_name        : (indirect string, offset: 0x589): PWR_TypeDef
    <938>   DW_AT_decl_file   : 5
    <939>   DW_AT_decl_line   : 1226
 <1><93b>: Abbrev Number: 15 (DW_TAG_structure_type)
    <93c>   DW_AT_byte_size   : 44
    <93d>   DW_AT_decl_file   : 5
    <93e>   DW_AT_decl_line   : 1213
 <2><940>: Abbrev Number: 12 (DW_TAG_member)
    <941>   DW_AT_name        : (indirect string, offset: 0x2ef): CR1
    <945>   DW_AT_type        : <0x36a>
    <949>   DW_AT_decl_file   : 5
    <94a>   DW_AT_decl_line   : 1215
    <94c>   DW_AT_data_member_location: 0
 <2><94d>: Abbrev Number: 12 (DW_TAG_member)
    <94e>   DW_AT_name        : (indirect string, offset: 0x55b): CSR1
    <952>   DW_AT_type        : <0x36a>
    <956>   DW_AT_decl_file   : 5
    <957>   DW_AT_decl_line   : 1216
    <959>   DW_AT_data_member_location: 4
 <2><95a>: Abbrev Number: 12 (DW_TAG_member)
    <95b>   DW_AT_name        : (indirect string, offset: 0x560): CR2
    <95f>   DW_AT_type        : <0x36a>
    <963>   DW_AT_decl_file   : 5
    <964>   DW_AT_decl_line   : 1217
    <966>   DW_AT_data_member_location: 8
 <2><967>: Abbrev Number: 12 (DW_TAG_member)
    <968>   DW_AT_name        : (indirect string, offset: 0x564): CR3
    <96c>   DW_AT_type        : <0x36a>
    <970>   DW_AT_decl_file   : 5
    <971>   DW_AT_decl_line   : 1218
    <973>   DW_AT_data_member_location: 12
 <2><974>: Abbrev Number: 12 (DW_TAG_member)
    <975>   DW_AT_name        : (indirect string, offset: 0x568): CPUCR
    <979>   DW_AT_type        : <0x36a>
    <97d>   DW_AT_decl_file   : 5
    <97e>   DW_AT_decl_line   : 1219
    <980>   DW_AT_data_member_location: 16
 <2><981>: Abbrev Number: 12 (DW_TAG_member)
    <982>   DW_AT_name        : (indirect string, offset: 0x180): RESERVED0
    <986>   DW_AT_type        : <0x37>
    <98a>   DW_AT_decl_file   : 5
    <98b>   DW_AT_decl_line   : 1220
    <98d>   DW_AT_data_member_location: 20
 <2><98e>: Abbrev Number: 12 (DW_TAG_member)
    <98f>   DW_AT_name        : (indirect string, offset: 0x56e): D3CR
    <993>   DW_AT_type        : <0x36a>
    <997>   DW_AT_decl_file   : 5
    <998>   DW_AT_decl_line   : 1221
    <99a>   DW_AT_data_member_location: 24
 <2><99b>: Abbrev Number: 12 (DW_TAG_member)
    <99c>   DW_AT_name        : (indirect string, offset: 0x358): RESERVED1
    <9a0>   DW_AT_type        : <0x37>
    <9a4>   DW_AT_decl_file   : 5
    <9a5>   DW_AT_decl_line   : 1222
    <9a7>   DW_AT_data_member_location: 28
 <2><9a8>: Abbrev Number: 12 (DW_TAG_member)
    <9a9>   DW_AT_name        : (indirect string, offset: 0x573): WKUPCR
    <9ad>   DW_AT_type        : <0x36a>
    <9b1>   DW_AT_decl_file   : 5
    <9b2>   DW_AT_decl_line   : 1223
    <9b4>   DW_AT_data_member_location: 32
 <2><9b5>: Abbrev Number: 12 (DW_TAG_member)
    <9b6>   DW_AT_name        : (indirect string, offset: 0x57a): WKUPFR
    <9ba>   DW_AT_type        : <0x36a>
    <9be>   DW_AT_decl_file   : 5
    <9bf>   DW_AT_decl_line   : 1224
    <9c1>   DW_AT_data_member_location: 36
 <2><9c2>: Abbrev Number: 12 (DW_TAG_member)
    <9c3>   DW_AT_name        : (indirect string, offset: 0x581): WKUPEPR
    <9c7>   DW_AT_type        : <0x36a>
    <9cb>   DW_AT_decl_file   : 5
    <9cc>   DW_AT_decl_line   : 1225
    <9ce>   DW_AT_data_member_location: 40
 <2><9cf>: Abbrev Number: 0
 <1><9d0>: Abbrev Number: 16 (DW_TAG_subprogram)
    <9d1>   DW_AT_low_pc      : 0x80003a6
    <9d5>   DW_AT_high_pc     : 0x166
    <9d9>   DW_AT_frame_base  : 1 byte block: 57 	(DW_OP_reg7 (r7))
    <9db>   DW_AT_name        : (indirect string, offset: 0x595): SystemInit
    <9df>   DW_AT_decl_file   : 3
    <9e0>   DW_AT_decl_line   : 180
    <9e1>   DW_AT_prototyped  : 1
    <9e1>   DW_AT_external    : 1
 <1><9e1>: Abbrev Number: 17 (DW_TAG_subprogram)
    <9e2>   DW_AT_low_pc      : 0
    <9e6>   DW_AT_high_pc     : 0x2e4
    <9ea>   DW_AT_frame_base  : 1 byte block: 57 	(DW_OP_reg7 (r7))
    <9ec>   DW_AT_name        : (indirect string, offset: 0x5a0): SystemCoreClockUpdate
    <9f0>   DW_AT_decl_file   : 3
    <9f1>   DW_AT_decl_line   : 354
    <9f3>   DW_AT_prototyped  : 1
    <9f3>   DW_AT_external    : 1
 <2><9f3>: Abbrev Number: 18 (DW_TAG_variable)
    <9f4>   DW_AT_location    : 2 byte block: 7d 28 	(DW_OP_breg13 (r13): 40)
    <9f7>   DW_AT_name        : (indirect string, offset: 0x5c3): pllp
    <9fb>   DW_AT_decl_file   : 3
    <9fc>   DW_AT_decl_line   : 356
    <9fe>   DW_AT_type        : <0x37>
 <2><a02>: Abbrev Number: 18 (DW_TAG_variable)
    <a03>   DW_AT_location    : 2 byte block: 7d 24 	(DW_OP_breg13 (r13): 36)
    <a06>   DW_AT_name        : (indirect string, offset: 0x5c8): pllsource
    <a0a>   DW_AT_decl_file   : 3
    <a0b>   DW_AT_decl_line   : 356
    <a0d>   DW_AT_type        : <0x37>
 <2><a11>: Abbrev Number: 18 (DW_TAG_variable)
    <a12>   DW_AT_location    : 2 byte block: 7d 20 	(DW_OP_breg13 (r13): 32)
    <a15>   DW_AT_name        : (indirect string, offset: 0x5d2): pllm
    <a19>   DW_AT_decl_file   : 3
    <a1a>   DW_AT_decl_line   : 356
    <a1c>   DW_AT_type        : <0x37>
 <2><a20>: Abbrev Number: 18 (DW_TAG_variable)
    <a21>   DW_AT_location    : 2 byte block: 7d 1c 	(DW_OP_breg13 (r13): 28)
    <a24>   DW_AT_name        : (indirect string, offset: 0x5d7): pllfracen
    <a28>   DW_AT_decl_file   : 3
    <a29>   DW_AT_decl_line   : 356
    <a2b>   DW_AT_type        : <0x37>
 <2><a2f>: Abbrev Number: 18 (DW_TAG_variable)
    <a30>   DW_AT_location    : 2 byte block: 7d 18 	(DW_OP_breg13 (r13): 24)
    <a33>   DW_AT_name        : (indirect string, offset: 0x5e1): hsivalue
    <a37>   DW_AT_decl_file   : 3
    <a38>   DW_AT_decl_line   : 356
    <a3a>   DW_AT_type        : <0x37>
 <2><a3e>: Abbrev Number: 18 (DW_TAG_variable)
    <a3f>   DW_AT_location    : 2 byte block: 7d 14 	(DW_OP_breg13 (r13): 20)
    <a42>   DW_AT_name        : (indirect string, offset: 0x5ea): tmp
    <a46>   DW_AT_decl_file   : 3
    <a47>   DW_AT_decl_line   : 356
    <a49>   DW_AT_type        : <0x37>
 <2><a4d>: Abbrev Number: 18 (DW_TAG_variable)
    <a4e>   DW_AT_location    : 2 byte block: 7d 10 	(DW_OP_breg13 (r13): 16)
    <a51>   DW_AT_name        : (indirect string, offset: 0x5ee): common_system_clock
    <a55>   DW_AT_decl_file   : 3
    <a56>   DW_AT_decl_line   : 357
    <a58>   DW_AT_type        : <0x37>
 <2><a5c>: Abbrev Number: 18 (DW_TAG_variable)
    <a5d>   DW_AT_location    : 2 byte block: 7d c 	(DW_OP_breg13 (r13): 12)
    <a60>   DW_AT_name        : (indirect string, offset: 0x602): fracn1
    <a64>   DW_AT_decl_file   : 3
    <a65>   DW_AT_decl_line   : 358
    <a67>   DW_AT_type        : <0x918>
 <2><a6b>: Abbrev Number: 18 (DW_TAG_variable)
    <a6c>   DW_AT_location    : 2 byte block: 7d 8 	(DW_OP_breg13 (r13): 8)
    <a6f>   DW_AT_name        : (indirect string, offset: 0x609): pllvco
    <a73>   DW_AT_decl_file   : 3
    <a74>   DW_AT_decl_line   : 358
    <a76>   DW_AT_type        : <0x918>
 <2><a7a>: Abbrev Number: 0
 <1><a7b>: Abbrev Number: 19 (DW_TAG_subprogram)
    <a7c>   DW_AT_low_pc      : 0x800050c
    <a80>   DW_AT_high_pc     : 0x28
    <a84>   DW_AT_frame_base  : 1 byte block: 57 	(DW_OP_reg7 (r7))
    <a86>   DW_AT_name        : (indirect string, offset: 0x5b6): ExitRun0Mode
    <a8a>   DW_AT_decl_file   : 3
    <a8b>   DW_AT_decl_line   : 476
    <a8d>   DW_AT_prototyped  : 1
    <a8d>   DW_AT_external    : 1
 <1><a8d>: Abbrev Number: 0
  Compilation Unit @ offset 0xa8e:
   Length:        0x101f (32-bit)
   Version:       4
   Abbrev Offset: 0xfc
   Pointer Size:  4
 <0><a99>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <a9a>   DW_AT_producer    : (indirect string, offset: 0): STMicroelectronics Arm Clang Toolchain --  clang version 19.1.6
    <a9e>   DW_AT_language    : 29	(C11)
    <aa0>   DW_AT_name        : (indirect string, offset: 0x610): /home/liaohy/User/Code/Stm32CubeMX/CLionDemo/Drivers/STM32H7xx_HAL_Driver/Src/stm32h7xx_hal_cortex.c
    <aa4>   DW_AT_stmt_list   : 0x564
    <aa8>   DW_AT_comp_dir    : (indirect string, offset: 0x89): /home/liaohy/User/Code/Stm32CubeMX/CLionDemo/build
    <aac>   DW_AT_low_pc      : 0
    <ab0>   DW_AT_ranges      : 0x20
 <1><ab4>: Abbrev Number: 2 (DW_TAG_enumeration_type)
    <ab5>   DW_AT_type        : <0xe73>
    <ab9>   DW_AT_byte_size   : 2
    <aba>   DW_AT_decl_file   : 1
    <abb>   DW_AT_decl_line   : 48
 <2><abc>: Abbrev Number: 3 (DW_TAG_enumerator)
    <abd>   DW_AT_name        : (indirect string, offset: 0x675): NonMaskableInt_IRQn
    <ac1>   DW_AT_const_value : -14
 <2><ac2>: Abbrev Number: 3 (DW_TAG_enumerator)
    <ac3>   DW_AT_name        : (indirect string, offset: 0x689): HardFault_IRQn
    <ac7>   DW_AT_const_value : -13
 <2><ac8>: Abbrev Number: 3 (DW_TAG_enumerator)
    <ac9>   DW_AT_name        : (indirect string, offset: 0x698): MemoryManagement_IRQn
    <acd>   DW_AT_const_value : -12
 <2><ace>: Abbrev Number: 3 (DW_TAG_enumerator)
    <acf>   DW_AT_name        : (indirect string, offset: 0x6ae): BusFault_IRQn
    <ad3>   DW_AT_const_value : -11
 <2><ad4>: Abbrev Number: 3 (DW_TAG_enumerator)
    <ad5>   DW_AT_name        : (indirect string, offset: 0x6bc): UsageFault_IRQn
    <ad9>   DW_AT_const_value : -10
 <2><ada>: Abbrev Number: 3 (DW_TAG_enumerator)
    <adb>   DW_AT_name        : (indirect string, offset: 0x6cc): SVCall_IRQn
    <adf>   DW_AT_const_value : -5
 <2><ae0>: Abbrev Number: 3 (DW_TAG_enumerator)
    <ae1>   DW_AT_name        : (indirect string, offset: 0x6d8): DebugMonitor_IRQn
    <ae5>   DW_AT_const_value : -4
 <2><ae6>: Abbrev Number: 3 (DW_TAG_enumerator)
    <ae7>   DW_AT_name        : (indirect string, offset: 0x6ea): PendSV_IRQn
    <aeb>   DW_AT_const_value : -2
 <2><aec>: Abbrev Number: 3 (DW_TAG_enumerator)
    <aed>   DW_AT_name        : (indirect string, offset: 0x6f6): SysTick_IRQn
    <af1>   DW_AT_const_value : -1
 <2><af2>: Abbrev Number: 3 (DW_TAG_enumerator)
    <af3>   DW_AT_name        : (indirect string, offset: 0x703): WWDG_IRQn
    <af7>   DW_AT_const_value : 0
 <2><af8>: Abbrev Number: 3 (DW_TAG_enumerator)
    <af9>   DW_AT_name        : (indirect string, offset: 0x70d): PVD_AVD_IRQn
    <afd>   DW_AT_const_value : 1
 <2><afe>: Abbrev Number: 3 (DW_TAG_enumerator)
    <aff>   DW_AT_name        : (indirect string, offset: 0x71a): TAMP_STAMP_IRQn
    <b03>   DW_AT_const_value : 2
 <2><b04>: Abbrev Number: 3 (DW_TAG_enumerator)
    <b05>   DW_AT_name        : (indirect string, offset: 0x72a): RTC_WKUP_IRQn
    <b09>   DW_AT_const_value : 3
 <2><b0a>: Abbrev Number: 3 (DW_TAG_enumerator)
    <b0b>   DW_AT_name        : (indirect string, offset: 0x738): FLASH_IRQn
    <b0f>   DW_AT_const_value : 4
 <2><b10>: Abbrev Number: 3 (DW_TAG_enumerator)
    <b11>   DW_AT_name        : (indirect string, offset: 0x743): RCC_IRQn
    <b15>   DW_AT_const_value : 5
 <2><b16>: Abbrev Number: 3 (DW_TAG_enumerator)
    <b17>   DW_AT_name        : (indirect string, offset: 0x74c): EXTI0_IRQn
    <b1b>   DW_AT_const_value : 6
 <2><b1c>: Abbrev Number: 3 (DW_TAG_enumerator)
    <b1d>   DW_AT_name        : (indirect string, offset: 0x757): EXTI1_IRQn
    <b21>   DW_AT_const_value : 7
 <2><b22>: Abbrev Number: 3 (DW_TAG_enumerator)
    <b23>   DW_AT_name        : (indirect string, offset: 0x762): EXTI2_IRQn
    <b27>   DW_AT_const_value : 8
 <2><b28>: Abbrev Number: 3 (DW_TAG_enumerator)
    <b29>   DW_AT_name        : (indirect string, offset: 0x76d): EXTI3_IRQn
    <b2d>   DW_AT_const_value : 9
 <2><b2e>: Abbrev Number: 3 (DW_TAG_enumerator)
    <b2f>   DW_AT_name        : (indirect string, offset: 0x778): EXTI4_IRQn
    <b33>   DW_AT_const_value : 10
 <2><b34>: Abbrev Number: 3 (DW_TAG_enumerator)
    <b35>   DW_AT_name        : (indirect string, offset: 0x783): DMA1_Stream0_IRQn
    <b39>   DW_AT_const_value : 11
 <2><b3a>: Abbrev Number: 3 (DW_TAG_enumerator)
    <b3b>   DW_AT_name        : (indirect string, offset: 0x795): DMA1_Stream1_IRQn
    <b3f>   DW_AT_const_value : 12
 <2><b40>: Abbrev Number: 3 (DW_TAG_enumerator)
    <b41>   DW_AT_name        : (indirect string, offset: 0x7a7): DMA1_Stream2_IRQn
    <b45>   DW_AT_const_value : 13
 <2><b46>: Abbrev Number: 3 (DW_TAG_enumerator)
    <b47>   DW_AT_name        : (indirect string, offset: 0x7b9): DMA1_Stream3_IRQn
    <b4b>   DW_AT_const_value : 14
 <2><b4c>: Abbrev Number: 3 (DW_TAG_enumerator)
    <b4d>   DW_AT_name        : (indirect string, offset: 0x7cb): DMA1_Stream4_IRQn
    <b51>   DW_AT_const_value : 15
 <2><b52>: Abbrev Number: 3 (DW_TAG_enumerator)
    <b53>   DW_AT_name        : (indirect string, offset: 0x7dd): DMA1_Stream5_IRQn
    <b57>   DW_AT_const_value : 16
 <2><b58>: Abbrev Number: 3 (DW_TAG_enumerator)
    <b59>   DW_AT_name        : (indirect string, offset: 0x7ef): DMA1_Stream6_IRQn
    <b5d>   DW_AT_const_value : 17
 <2><b5e>: Abbrev Number: 3 (DW_TAG_enumerator)
    <b5f>   DW_AT_name        : (indirect string, offset: 0x801): ADC_IRQn
    <b63>   DW_AT_const_value : 18
 <2><b64>: Abbrev Number: 3 (DW_TAG_enumerator)
    <b65>   DW_AT_name        : (indirect string, offset: 0x80a): FDCAN1_IT0_IRQn
    <b69>   DW_AT_const_value : 19
 <2><b6a>: Abbrev Number: 3 (DW_TAG_enumerator)
    <b6b>   DW_AT_name        : (indirect string, offset: 0x81a): FDCAN2_IT0_IRQn
    <b6f>   DW_AT_const_value : 20
 <2><b70>: Abbrev Number: 3 (DW_TAG_enumerator)
    <b71>   DW_AT_name        : (indirect string, offset: 0x82a): FDCAN1_IT1_IRQn
    <b75>   DW_AT_const_value : 21
 <2><b76>: Abbrev Number: 3 (DW_TAG_enumerator)
    <b77>   DW_AT_name        : (indirect string, offset: 0x83a): FDCAN2_IT1_IRQn
    <b7b>   DW_AT_const_value : 22
 <2><b7c>: Abbrev Number: 3 (DW_TAG_enumerator)
    <b7d>   DW_AT_name        : (indirect string, offset: 0x84a): EXTI9_5_IRQn
    <b81>   DW_AT_const_value : 23
 <2><b82>: Abbrev Number: 3 (DW_TAG_enumerator)
    <b83>   DW_AT_name        : (indirect string, offset: 0x857): TIM1_BRK_IRQn
    <b87>   DW_AT_const_value : 24
 <2><b88>: Abbrev Number: 3 (DW_TAG_enumerator)
    <b89>   DW_AT_name        : (indirect string, offset: 0x865): TIM1_UP_IRQn
    <b8d>   DW_AT_const_value : 25
 <2><b8e>: Abbrev Number: 3 (DW_TAG_enumerator)
    <b8f>   DW_AT_name        : (indirect string, offset: 0x872): TIM1_TRG_COM_IRQn
    <b93>   DW_AT_const_value : 26
 <2><b94>: Abbrev Number: 3 (DW_TAG_enumerator)
    <b95>   DW_AT_name        : (indirect string, offset: 0x884): TIM1_CC_IRQn
    <b99>   DW_AT_const_value : 27
 <2><b9a>: Abbrev Number: 3 (DW_TAG_enumerator)
    <b9b>   DW_AT_name        : (indirect string, offset: 0xd1b): TIM2_IRQn
    <b9f>   DW_AT_const_value : 28
 <2><ba0>: Abbrev Number: 3 (DW_TAG_enumerator)
    <ba1>   DW_AT_name        : (indirect string, offset: 0xd27): TIM3_IRQn
    <ba5>   DW_AT_const_value : 29
 <2><ba6>: Abbrev Number: 3 (DW_TAG_enumerator)
    <ba7>   DW_AT_name        : (indirect string, offset: 0xd33): TIM4_IRQn
    <bab>   DW_AT_const_value : 30
 <2><bac>: Abbrev Number: 3 (DW_TAG_enumerator)
    <bad>   DW_AT_name        : (indirect string, offset: 0x891): I2C1_EV_IRQn
    <bb1>   DW_AT_const_value : 31
 <2><bb2>: Abbrev Number: 3 (DW_TAG_enumerator)
    <bb3>   DW_AT_name        : (indirect string, offset: 0x89e): I2C1_ER_IRQn
    <bb7>   DW_AT_const_value : 32
 <2><bb8>: Abbrev Number: 3 (DW_TAG_enumerator)
    <bb9>   DW_AT_name        : (indirect string, offset: 0x8ab): I2C2_EV_IRQn
    <bbd>   DW_AT_const_value : 33
 <2><bbe>: Abbrev Number: 3 (DW_TAG_enumerator)
    <bbf>   DW_AT_name        : (indirect string, offset: 0x8b8): I2C2_ER_IRQn
    <bc3>   DW_AT_const_value : 34
 <2><bc4>: Abbrev Number: 3 (DW_TAG_enumerator)
    <bc5>   DW_AT_name        : (indirect string, offset: 0xb57): SPI1_IRQn
    <bc9>   DW_AT_const_value : 35
 <2><bca>: Abbrev Number: 3 (DW_TAG_enumerator)
    <bcb>   DW_AT_name        : (indirect string, offset: 0xd8f): SPI2_IRQn
    <bcf>   DW_AT_const_value : 36
 <2><bd0>: Abbrev Number: 3 (DW_TAG_enumerator)
    <bd1>   DW_AT_name        : (indirect string, offset: 0x8c5): USART1_IRQn
    <bd5>   DW_AT_const_value : 37
 <2><bd6>: Abbrev Number: 3 (DW_TAG_enumerator)
    <bd7>   DW_AT_name        : (indirect string, offset: 0x8d1): USART2_IRQn
    <bdb>   DW_AT_const_value : 38
 <2><bdc>: Abbrev Number: 3 (DW_TAG_enumerator)
    <bdd>   DW_AT_name        : (indirect string, offset: 0x8dd): USART3_IRQn
    <be1>   DW_AT_const_value : 39
 <2><be2>: Abbrev Number: 3 (DW_TAG_enumerator)
    <be3>   DW_AT_name        : (indirect string, offset: 0x8e9): EXTI15_10_IRQn
    <be7>   DW_AT_const_value : 40
 <2><be8>: Abbrev Number: 3 (DW_TAG_enumerator)
    <be9>   DW_AT_name        : (indirect string, offset: 0x8f8): RTC_Alarm_IRQn
    <bed>   DW_AT_const_value : 41
 <2><bee>: Abbrev Number: 3 (DW_TAG_enumerator)
    <bef>   DW_AT_name        : (indirect string, offset: 0x907): TIM8_BRK_TIM12_IRQn
    <bf3>   DW_AT_const_value : 43
 <2><bf4>: Abbrev Number: 3 (DW_TAG_enumerator)
    <bf5>   DW_AT_name        : (indirect string, offset: 0x91b): TIM8_UP_TIM13_IRQn
    <bf9>   DW_AT_const_value : 44
 <2><bfa>: Abbrev Number: 3 (DW_TAG_enumerator)
    <bfb>   DW_AT_name        : (indirect string, offset: 0x92e): TIM8_TRG_COM_TIM14_IRQn
    <bff>   DW_AT_const_value : 45
 <2><c00>: Abbrev Number: 3 (DW_TAG_enumerator)
    <c01>   DW_AT_name        : (indirect string, offset: 0x946): TIM8_CC_IRQn
    <c05>   DW_AT_const_value : 46
 <2><c06>: Abbrev Number: 3 (DW_TAG_enumerator)
    <c07>   DW_AT_name        : (indirect string, offset: 0x953): DMA1_Stream7_IRQn
    <c0b>   DW_AT_const_value : 47
 <2><c0c>: Abbrev Number: 3 (DW_TAG_enumerator)
    <c0d>   DW_AT_name        : (indirect string, offset: 0x965): FMC_IRQn
    <c11>   DW_AT_const_value : 48
 <2><c12>: Abbrev Number: 3 (DW_TAG_enumerator)
    <c13>   DW_AT_name        : (indirect string, offset: 0x96e): SDMMC1_IRQn
    <c17>   DW_AT_const_value : 49
 <2><c18>: Abbrev Number: 3 (DW_TAG_enumerator)
    <c19>   DW_AT_name        : (indirect string, offset: 0xd3f): TIM5_IRQn
    <c1d>   DW_AT_const_value : 50
 <2><c1e>: Abbrev Number: 3 (DW_TAG_enumerator)
    <c1f>   DW_AT_name        : (indirect string, offset: 0x97a): SPI3_IRQn
    <c23>   DW_AT_const_value : 51
 <2><c24>: Abbrev Number: 3 (DW_TAG_enumerator)
    <c25>   DW_AT_name        : (indirect string, offset: 0x984): UART4_IRQn
    <c29>   DW_AT_const_value : 52
 <2><c2a>: Abbrev Number: 3 (DW_TAG_enumerator)
    <c2b>   DW_AT_name        : (indirect string, offset: 0x98f): UART5_IRQn
    <c2f>   DW_AT_const_value : 53
 <2><c30>: Abbrev Number: 3 (DW_TAG_enumerator)
    <c31>   DW_AT_name        : (indirect string, offset: 0x99a): TIM6_DAC_IRQn
    <c35>   DW_AT_const_value : 54
 <2><c36>: Abbrev Number: 3 (DW_TAG_enumerator)
    <c37>   DW_AT_name        : (indirect string, offset: 0x9a8): TIM7_IRQn
    <c3b>   DW_AT_const_value : 55
 <2><c3c>: Abbrev Number: 3 (DW_TAG_enumerator)
    <c3d>   DW_AT_name        : (indirect string, offset: 0x9b2): DMA2_Stream0_IRQn
    <c41>   DW_AT_const_value : 56
 <2><c42>: Abbrev Number: 3 (DW_TAG_enumerator)
    <c43>   DW_AT_name        : (indirect string, offset: 0x9c4): DMA2_Stream1_IRQn
    <c47>   DW_AT_const_value : 57
 <2><c48>: Abbrev Number: 3 (DW_TAG_enumerator)
    <c49>   DW_AT_name        : (indirect string, offset: 0x9d6): DMA2_Stream2_IRQn
    <c4d>   DW_AT_const_value : 58
 <2><c4e>: Abbrev Number: 3 (DW_TAG_enumerator)
    <c4f>   DW_AT_name        : (indirect string, offset: 0x9e8): DMA2_Stream3_IRQn
    <c53>   DW_AT_const_value : 59
 <2><c54>: Abbrev Number: 3 (DW_TAG_enumerator)
    <c55>   DW_AT_name        : (indirect string, offset: 0x9fa): DMA2_Stream4_IRQn
    <c59>   DW_AT_const_value : 60
 <2><c5a>: Abbrev Number: 3 (DW_TAG_enumerator)
    <c5b>   DW_AT_name        : (indirect string, offset: 0xa0c): ETH_IRQn
    <c5f>   DW_AT_const_value : 61
 <2><c60>: Abbrev Number: 3 (DW_TAG_enumerator)
    <c61>   DW_AT_name        : (indirect string, offset: 0xa15): ETH_WKUP_IRQn
    <c65>   DW_AT_const_value : 62
 <2><c66>: Abbrev Number: 3 (DW_TAG_enumerator)
    <c67>   DW_AT_name        : (indirect string, offset: 0xa23): FDCAN_CAL_IRQn
    <c6b>   DW_AT_const_value : 63
 <2><c6c>: Abbrev Number: 3 (DW_TAG_enumerator)
    <c6d>   DW_AT_name        : (indirect string, offset: 0xa32): DMA2_Stream5_IRQn
    <c71>   DW_AT_const_value : 68
 <2><c73>: Abbrev Number: 3 (DW_TAG_enumerator)
    <c74>   DW_AT_name        : (indirect string, offset: 0xa44): DMA2_Stream6_IRQn
    <c78>   DW_AT_const_value : 69
 <2><c7a>: Abbrev Number: 3 (DW_TAG_enumerator)
    <c7b>   DW_AT_name        : (indirect string, offset: 0xa56): DMA2_Stream7_IRQn
    <c7f>   DW_AT_const_value : 70
 <2><c81>: Abbrev Number: 3 (DW_TAG_enumerator)
    <c82>   DW_AT_name        : (indirect string, offset: 0xa68): USART6_IRQn
    <c86>   DW_AT_const_value : 71
 <2><c88>: Abbrev Number: 3 (DW_TAG_enumerator)
    <c89>   DW_AT_name        : (indirect string, offset: 0xa74): I2C3_EV_IRQn
    <c8d>   DW_AT_const_value : 72
 <2><c8f>: Abbrev Number: 3 (DW_TAG_enumerator)
    <c90>   DW_AT_name        : (indirect string, offset: 0xa81): I2C3_ER_IRQn
    <c94>   DW_AT_const_value : 73
 <2><c96>: Abbrev Number: 3 (DW_TAG_enumerator)
    <c97>   DW_AT_name        : (indirect string, offset: 0xa8e): OTG_HS_EP1_OUT_IRQn
    <c9b>   DW_AT_const_value : 74
 <2><c9d>: Abbrev Number: 3 (DW_TAG_enumerator)
    <c9e>   DW_AT_name        : (indirect string, offset: 0xaa2): OTG_HS_EP1_IN_IRQn
    <ca2>   DW_AT_const_value : 75
 <2><ca4>: Abbrev Number: 3 (DW_TAG_enumerator)
    <ca5>   DW_AT_name        : (indirect string, offset: 0xab5): OTG_HS_WKUP_IRQn
    <ca9>   DW_AT_const_value : 76
 <2><cab>: Abbrev Number: 3 (DW_TAG_enumerator)
    <cac>   DW_AT_name        : (indirect string, offset: 0xac6): OTG_HS_IRQn
    <cb0>   DW_AT_const_value : 77
 <2><cb2>: Abbrev Number: 3 (DW_TAG_enumerator)
    <cb3>   DW_AT_name        : (indirect string, offset: 0xad2): DCMI_PSSI_IRQn
    <cb7>   DW_AT_const_value : 78
 <2><cb9>: Abbrev Number: 3 (DW_TAG_enumerator)
    <cba>   DW_AT_name        : (indirect string, offset: 0xae1): RNG_IRQn
    <cbe>   DW_AT_const_value : 80
 <2><cc0>: Abbrev Number: 3 (DW_TAG_enumerator)
    <cc1>   DW_AT_name        : (indirect string, offset: 0xaea): FPU_IRQn
    <cc5>   DW_AT_const_value : 81
 <2><cc7>: Abbrev Number: 3 (DW_TAG_enumerator)
    <cc8>   DW_AT_name        : (indirect string, offset: 0xaf3): UART7_IRQn
    <ccc>   DW_AT_const_value : 82
 <2><cce>: Abbrev Number: 3 (DW_TAG_enumerator)
    <ccf>   DW_AT_name        : (indirect string, offset: 0xafe): UART8_IRQn
    <cd3>   DW_AT_const_value : 83
 <2><cd5>: Abbrev Number: 3 (DW_TAG_enumerator)
    <cd6>   DW_AT_name        : (indirect string, offset: 0xb09): SPI4_IRQn
    <cda>   DW_AT_const_value : 84
 <2><cdc>: Abbrev Number: 3 (DW_TAG_enumerator)
    <cdd>   DW_AT_name        : (indirect string, offset: 0xb13): SPI5_IRQn
    <ce1>   DW_AT_const_value : 85
 <2><ce3>: Abbrev Number: 3 (DW_TAG_enumerator)
    <ce4>   DW_AT_name        : (indirect string, offset: 0xb1d): SPI6_IRQn
    <ce8>   DW_AT_const_value : 86
 <2><cea>: Abbrev Number: 3 (DW_TAG_enumerator)
    <ceb>   DW_AT_name        : (indirect string, offset: 0xb27): SAI1_IRQn
    <cef>   DW_AT_const_value : 87
 <2><cf1>: Abbrev Number: 3 (DW_TAG_enumerator)
    <cf2>   DW_AT_name        : (indirect string, offset: 0xb31): LTDC_IRQn
    <cf6>   DW_AT_const_value : 88
 <2><cf8>: Abbrev Number: 3 (DW_TAG_enumerator)
    <cf9>   DW_AT_name        : (indirect string, offset: 0xb3b): LTDC_ER_IRQn
    <cfd>   DW_AT_const_value : 89
 <2><cff>: Abbrev Number: 3 (DW_TAG_enumerator)
    <d00>   DW_AT_name        : (indirect string, offset: 0xb48): DMA2D_IRQn
    <d04>   DW_AT_const_value : 90
 <2><d06>: Abbrev Number: 3 (DW_TAG_enumerator)
    <d07>   DW_AT_name        : (indirect string, offset: 0xb53): OCTOSPI1_IRQn
    <d0b>   DW_AT_const_value : 92
 <2><d0d>: Abbrev Number: 3 (DW_TAG_enumerator)
    <d0e>   DW_AT_name        : (indirect string, offset: 0xb61): LPTIM1_IRQn
    <d12>   DW_AT_const_value : 93
 <2><d14>: Abbrev Number: 3 (DW_TAG_enumerator)
    <d15>   DW_AT_name        : (indirect string, offset: 0xb6d): CEC_IRQn
    <d19>   DW_AT_const_value : 94
 <2><d1b>: Abbrev Number: 3 (DW_TAG_enumerator)
    <d1c>   DW_AT_name        : (indirect string, offset: 0xb76): I2C4_EV_IRQn
    <d20>   DW_AT_const_value : 95
 <2><d22>: Abbrev Number: 3 (DW_TAG_enumerator)
    <d23>   DW_AT_name        : (indirect string, offset: 0xb83): I2C4_ER_IRQn
    <d27>   DW_AT_const_value : 96
 <2><d29>: Abbrev Number: 3 (DW_TAG_enumerator)
    <d2a>   DW_AT_name        : (indirect string, offset: 0xb90): SPDIF_RX_IRQn
    <d2e>   DW_AT_const_value : 97
 <2><d30>: Abbrev Number: 3 (DW_TAG_enumerator)
    <d31>   DW_AT_name        : (indirect string, offset: 0xb9e): DMAMUX1_OVR_IRQn
    <d35>   DW_AT_const_value : 102
 <2><d37>: Abbrev Number: 3 (DW_TAG_enumerator)
    <d38>   DW_AT_name        : (indirect string, offset: 0xbaf): DFSDM1_FLT0_IRQn
    <d3c>   DW_AT_const_value : 110
 <2><d3e>: Abbrev Number: 3 (DW_TAG_enumerator)
    <d3f>   DW_AT_name        : (indirect string, offset: 0xbc0): DFSDM1_FLT1_IRQn
    <d43>   DW_AT_const_value : 111
 <2><d45>: Abbrev Number: 3 (DW_TAG_enumerator)
    <d46>   DW_AT_name        : (indirect string, offset: 0xbd1): DFSDM1_FLT2_IRQn
    <d4a>   DW_AT_const_value : 112
 <2><d4c>: Abbrev Number: 3 (DW_TAG_enumerator)
    <d4d>   DW_AT_name        : (indirect string, offset: 0xbe2): DFSDM1_FLT3_IRQn
    <d51>   DW_AT_const_value : 113
 <2><d53>: Abbrev Number: 3 (DW_TAG_enumerator)
    <d54>   DW_AT_name        : (indirect string, offset: 0xbf3): SWPMI1_IRQn
    <d58>   DW_AT_const_value : 115
 <2><d5a>: Abbrev Number: 3 (DW_TAG_enumerator)
    <d5b>   DW_AT_name        : (indirect string, offset: 0xbff): TIM15_IRQn
    <d5f>   DW_AT_const_value : 116
 <2><d61>: Abbrev Number: 3 (DW_TAG_enumerator)
    <d62>   DW_AT_name        : (indirect string, offset: 0xc0a): TIM16_IRQn
    <d66>   DW_AT_const_value : 117
 <2><d68>: Abbrev Number: 3 (DW_TAG_enumerator)
    <d69>   DW_AT_name        : (indirect string, offset: 0xc15): TIM17_IRQn
    <d6d>   DW_AT_const_value : 118
 <2><d6f>: Abbrev Number: 3 (DW_TAG_enumerator)
    <d70>   DW_AT_name        : (indirect string, offset: 0xc20): MDIOS_WKUP_IRQn
    <d74>   DW_AT_const_value : 119
 <2><d76>: Abbrev Number: 3 (DW_TAG_enumerator)
    <d77>   DW_AT_name        : (indirect string, offset: 0xc30): MDIOS_IRQn
    <d7b>   DW_AT_const_value : 120
 <2><d7d>: Abbrev Number: 3 (DW_TAG_enumerator)
    <d7e>   DW_AT_name        : (indirect string, offset: 0xc3b): MDMA_IRQn
    <d82>   DW_AT_const_value : 122
 <2><d84>: Abbrev Number: 3 (DW_TAG_enumerator)
    <d85>   DW_AT_name        : (indirect string, offset: 0xc45): SDMMC2_IRQn
    <d89>   DW_AT_const_value : 124
 <2><d8b>: Abbrev Number: 3 (DW_TAG_enumerator)
    <d8c>   DW_AT_name        : (indirect string, offset: 0xc51): HSEM1_IRQn
    <d90>   DW_AT_const_value : 125
 <2><d92>: Abbrev Number: 3 (DW_TAG_enumerator)
    <d93>   DW_AT_name        : (indirect string, offset: 0xc5c): ADC3_IRQn
    <d97>   DW_AT_const_value : 127
 <2><d99>: Abbrev Number: 3 (DW_TAG_enumerator)
    <d9a>   DW_AT_name        : (indirect string, offset: 0xc66): DMAMUX2_OVR_IRQn
    <d9e>   DW_AT_const_value : 128
 <2><da0>: Abbrev Number: 3 (DW_TAG_enumerator)
    <da1>   DW_AT_name        : (indirect string, offset: 0xc77): BDMA_Channel0_IRQn
    <da5>   DW_AT_const_value : 129
 <2><da7>: Abbrev Number: 3 (DW_TAG_enumerator)
    <da8>   DW_AT_name        : (indirect string, offset: 0xc8a): BDMA_Channel1_IRQn
    <dac>   DW_AT_const_value : 130
 <2><dae>: Abbrev Number: 3 (DW_TAG_enumerator)
    <daf>   DW_AT_name        : (indirect string, offset: 0xc9d): BDMA_Channel2_IRQn
    <db3>   DW_AT_const_value : 131
 <2><db5>: Abbrev Number: 3 (DW_TAG_enumerator)
    <db6>   DW_AT_name        : (indirect string, offset: 0xcb0): BDMA_Channel3_IRQn
    <dba>   DW_AT_const_value : 132
 <2><dbc>: Abbrev Number: 3 (DW_TAG_enumerator)
    <dbd>   DW_AT_name        : (indirect string, offset: 0xcc3): BDMA_Channel4_IRQn
    <dc1>   DW_AT_const_value : 133
 <2><dc3>: Abbrev Number: 3 (DW_TAG_enumerator)
    <dc4>   DW_AT_name        : (indirect string, offset: 0xcd6): BDMA_Channel5_IRQn
    <dc8>   DW_AT_const_value : 134
 <2><dca>: Abbrev Number: 3 (DW_TAG_enumerator)
    <dcb>   DW_AT_name        : (indirect string, offset: 0xce9): BDMA_Channel6_IRQn
    <dcf>   DW_AT_const_value : 135
 <2><dd1>: Abbrev Number: 3 (DW_TAG_enumerator)
    <dd2>   DW_AT_name        : (indirect string, offset: 0xcfc): BDMA_Channel7_IRQn
    <dd6>   DW_AT_const_value : 136
 <2><dd8>: Abbrev Number: 3 (DW_TAG_enumerator)
    <dd9>   DW_AT_name        : (indirect string, offset: 0xd0f): COMP_IRQn
    <ddd>   DW_AT_const_value : 137
 <2><ddf>: Abbrev Number: 3 (DW_TAG_enumerator)
    <de0>   DW_AT_name        : (indirect string, offset: 0xd19): LPTIM2_IRQn
    <de4>   DW_AT_const_value : 138
 <2><de6>: Abbrev Number: 3 (DW_TAG_enumerator)
    <de7>   DW_AT_name        : (indirect string, offset: 0xd25): LPTIM3_IRQn
    <deb>   DW_AT_const_value : 139
 <2><ded>: Abbrev Number: 3 (DW_TAG_enumerator)
    <dee>   DW_AT_name        : (indirect string, offset: 0xd31): LPTIM4_IRQn
    <df2>   DW_AT_const_value : 140
 <2><df4>: Abbrev Number: 3 (DW_TAG_enumerator)
    <df5>   DW_AT_name        : (indirect string, offset: 0xd3d): LPTIM5_IRQn
    <df9>   DW_AT_const_value : 141
 <2><dfb>: Abbrev Number: 3 (DW_TAG_enumerator)
    <dfc>   DW_AT_name        : (indirect string, offset: 0xd49): LPUART1_IRQn
    <e00>   DW_AT_const_value : 142
 <2><e02>: Abbrev Number: 3 (DW_TAG_enumerator)
    <e03>   DW_AT_name        : (indirect string, offset: 0xd56): CRS_IRQn
    <e07>   DW_AT_const_value : 144
 <2><e09>: Abbrev Number: 3 (DW_TAG_enumerator)
    <e0a>   DW_AT_name        : (indirect string, offset: 0xd5f): ECC_IRQn
    <e0e>   DW_AT_const_value : 145
 <2><e10>: Abbrev Number: 3 (DW_TAG_enumerator)
    <e11>   DW_AT_name        : (indirect string, offset: 0xd68): SAI4_IRQn
    <e15>   DW_AT_const_value : 146
 <2><e17>: Abbrev Number: 3 (DW_TAG_enumerator)
    <e18>   DW_AT_name        : (indirect string, offset: 0xd72): DTS_IRQn
    <e1c>   DW_AT_const_value : 147
 <2><e1e>: Abbrev Number: 3 (DW_TAG_enumerator)
    <e1f>   DW_AT_name        : (indirect string, offset: 0xd7b): WAKEUP_PIN_IRQn
    <e23>   DW_AT_const_value : 149
 <2><e25>: Abbrev Number: 3 (DW_TAG_enumerator)
    <e26>   DW_AT_name        : (indirect string, offset: 0xd8b): OCTOSPI2_IRQn
    <e2a>   DW_AT_const_value : 150
 <2><e2c>: Abbrev Number: 3 (DW_TAG_enumerator)
    <e2d>   DW_AT_name        : (indirect string, offset: 0xd99): FMAC_IRQn
    <e31>   DW_AT_const_value : 153
 <2><e33>: Abbrev Number: 3 (DW_TAG_enumerator)
    <e34>   DW_AT_name        : (indirect string, offset: 0xda3): CORDIC_IRQn
    <e38>   DW_AT_const_value : 154
 <2><e3a>: Abbrev Number: 3 (DW_TAG_enumerator)
    <e3b>   DW_AT_name        : (indirect string, offset: 0xdaf): UART9_IRQn
    <e3f>   DW_AT_const_value : 155
 <2><e41>: Abbrev Number: 3 (DW_TAG_enumerator)
    <e42>   DW_AT_name        : (indirect string, offset: 0xdba): USART10_IRQn
    <e46>   DW_AT_const_value : 156
 <2><e48>: Abbrev Number: 3 (DW_TAG_enumerator)
    <e49>   DW_AT_name        : (indirect string, offset: 0xdc7): I2C5_EV_IRQn
    <e4d>   DW_AT_const_value : 157
 <2><e4f>: Abbrev Number: 3 (DW_TAG_enumerator)
    <e50>   DW_AT_name        : (indirect string, offset: 0xdd4): I2C5_ER_IRQn
    <e54>   DW_AT_const_value : 158
 <2><e56>: Abbrev Number: 3 (DW_TAG_enumerator)
    <e57>   DW_AT_name        : (indirect string, offset: 0xde1): FDCAN3_IT0_IRQn
    <e5b>   DW_AT_const_value : 159
 <2><e5d>: Abbrev Number: 3 (DW_TAG_enumerator)
    <e5e>   DW_AT_name        : (indirect string, offset: 0xdf1): FDCAN3_IT1_IRQn
    <e62>   DW_AT_const_value : 160
 <2><e64>: Abbrev Number: 3 (DW_TAG_enumerator)
    <e65>   DW_AT_name        : (indirect string, offset: 0xe01): TIM23_IRQn
    <e69>   DW_AT_const_value : 161
 <2><e6b>: Abbrev Number: 3 (DW_TAG_enumerator)
    <e6c>   DW_AT_name        : (indirect string, offset: 0xe0c): TIM24_IRQn
    <e70>   DW_AT_const_value : 162
 <2><e72>: Abbrev Number: 0
 <1><e73>: Abbrev Number: 4 (DW_TAG_base_type)
    <e74>   DW_AT_name        : (indirect string, offset: 0x137b): short
    <e78>   DW_AT_encoding    : 5	(signed)
    <e79>   DW_AT_byte_size   : 2
 <1><e7a>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <e7b>   DW_AT_type        : <0xe7f>
 <1><e7f>: Abbrev Number: 6 (DW_TAG_typedef)
    <e80>   DW_AT_type        : <0xe8b>
    <e84>   DW_AT_name        : (indirect string, offset: 0x266): SCB_Type
    <e88>   DW_AT_decl_file   : 4
    <e89>   DW_AT_decl_line   : 507
 <1><e8b>: Abbrev Number: 7 (DW_TAG_structure_type)
    <e8c>   DW_AT_byte_size   : 684
    <e8e>   DW_AT_decl_file   : 4
    <e8f>   DW_AT_decl_line   : 455
 <2><e91>: Abbrev Number: 8 (DW_TAG_member)
    <e92>   DW_AT_name        : (indirect string, offset: 0x11a3): CPUID
    <e96>   DW_AT_type        : <0x1134>
    <e9a>   DW_AT_decl_file   : 4
    <e9b>   DW_AT_decl_line   : 457
    <e9d>   DW_AT_data_member_location: 0
 <2><e9e>: Abbrev Number: 8 (DW_TAG_member)
    <e9f>   DW_AT_name        : (indirect string, offset: 0x122): ICSR
    <ea3>   DW_AT_type        : <0x1139>
    <ea7>   DW_AT_decl_file   : 4
    <ea8>   DW_AT_decl_line   : 458
    <eaa>   DW_AT_data_member_location: 4
 <2><eab>: Abbrev Number: 8 (DW_TAG_member)
    <eac>   DW_AT_name        : (indirect string, offset: 0x127): VTOR
    <eb0>   DW_AT_type        : <0x1139>
    <eb4>   DW_AT_decl_file   : 4
    <eb5>   DW_AT_decl_line   : 459
    <eb7>   DW_AT_data_member_location: 8
 <2><eb8>: Abbrev Number: 8 (DW_TAG_member)
    <eb9>   DW_AT_name        : (indirect string, offset: 0x12c): AIRCR
    <ebd>   DW_AT_type        : <0x1139>
    <ec1>   DW_AT_decl_file   : 4
    <ec2>   DW_AT_decl_line   : 460
    <ec4>   DW_AT_data_member_location: 12
 <2><ec5>: Abbrev Number: 8 (DW_TAG_member)
    <ec6>   DW_AT_name        : (indirect string, offset: 0x252): SCR
    <eca>   DW_AT_type        : <0x1139>
    <ece>   DW_AT_decl_file   : 4
    <ecf>   DW_AT_decl_line   : 461
    <ed1>   DW_AT_data_member_location: 16
 <2><ed2>: Abbrev Number: 8 (DW_TAG_member)
    <ed3>   DW_AT_name        : (indirect string, offset: 0x21d1): CCR
    <ed7>   DW_AT_type        : <0x1139>
    <edb>   DW_AT_decl_file   : 4
    <edc>   DW_AT_decl_line   : 462
    <ede>   DW_AT_data_member_location: 20
 <2><edf>: Abbrev Number: 8 (DW_TAG_member)
    <ee0>   DW_AT_name        : (indirect string, offset: 0x132): SHPR
    <ee4>   DW_AT_type        : <0x115b>
    <ee8>   DW_AT_decl_file   : 4
    <ee9>   DW_AT_decl_line   : 463
    <eeb>   DW_AT_data_member_location: 24
 <2><eec>: Abbrev Number: 8 (DW_TAG_member)
    <eed>   DW_AT_name        : (indirect string, offset: 0x137): SHCSR
    <ef1>   DW_AT_type        : <0x1139>
    <ef5>   DW_AT_decl_file   : 4
    <ef6>   DW_AT_decl_line   : 464
    <ef8>   DW_AT_data_member_location: 36
 <2><ef9>: Abbrev Number: 8 (DW_TAG_member)
    <efa>   DW_AT_name        : (indirect string, offset: 0x13d): CFSR
    <efe>   DW_AT_type        : <0x1139>
    <f02>   DW_AT_decl_file   : 4
    <f03>   DW_AT_decl_line   : 465
    <f05>   DW_AT_data_member_location: 40
 <2><f06>: Abbrev Number: 8 (DW_TAG_member)
    <f07>   DW_AT_name        : (indirect string, offset: 0x142): HFSR
    <f0b>   DW_AT_type        : <0x1139>
    <f0f>   DW_AT_decl_file   : 4
    <f10>   DW_AT_decl_line   : 466
    <f12>   DW_AT_data_member_location: 44
 <2><f13>: Abbrev Number: 8 (DW_TAG_member)
    <f14>   DW_AT_name        : (indirect string, offset: 0x147): DFSR
    <f18>   DW_AT_type        : <0x1139>
    <f1c>   DW_AT_decl_file   : 4
    <f1d>   DW_AT_decl_line   : 467
    <f1f>   DW_AT_data_member_location: 48
 <2><f20>: Abbrev Number: 8 (DW_TAG_member)
    <f21>   DW_AT_name        : (indirect string, offset: 0x14c): MMFAR
    <f25>   DW_AT_type        : <0x1139>
    <f29>   DW_AT_decl_file   : 4
    <f2a>   DW_AT_decl_line   : 468
    <f2c>   DW_AT_data_member_location: 52
 <2><f2d>: Abbrev Number: 8 (DW_TAG_member)
    <f2e>   DW_AT_name        : (indirect string, offset: 0x152): BFAR
    <f32>   DW_AT_type        : <0x1139>
    <f36>   DW_AT_decl_file   : 4
    <f37>   DW_AT_decl_line   : 469
    <f39>   DW_AT_data_member_location: 56
 <2><f3a>: Abbrev Number: 8 (DW_TAG_member)
    <f3b>   DW_AT_name        : (indirect string, offset: 0x157): AFSR
    <f3f>   DW_AT_type        : <0x1139>
    <f43>   DW_AT_decl_file   : 4
    <f44>   DW_AT_decl_line   : 470
    <f46>   DW_AT_data_member_location: 60
 <2><f47>: Abbrev Number: 8 (DW_TAG_member)
    <f48>   DW_AT_name        : (indirect string, offset: 0x15c): ID_PFR
    <f4c>   DW_AT_type        : <0x1190>
    <f50>   DW_AT_decl_file   : 4
    <f51>   DW_AT_decl_line   : 471
    <f53>   DW_AT_data_member_location: 64
 <2><f54>: Abbrev Number: 8 (DW_TAG_member)
    <f55>   DW_AT_name        : (indirect string, offset: 0x163): ID_DFR
    <f59>   DW_AT_type        : <0x1134>
    <f5d>   DW_AT_decl_file   : 4
    <f5e>   DW_AT_decl_line   : 472
    <f60>   DW_AT_data_member_location: 72
 <2><f61>: Abbrev Number: 8 (DW_TAG_member)
    <f62>   DW_AT_name        : (indirect string, offset: 0x16a): ID_AFR
    <f66>   DW_AT_type        : <0x1134>
    <f6a>   DW_AT_decl_file   : 4
    <f6b>   DW_AT_decl_line   : 473
    <f6d>   DW_AT_data_member_location: 76
 <2><f6e>: Abbrev Number: 8 (DW_TAG_member)
    <f6f>   DW_AT_name        : (indirect string, offset: 0x171): ID_MFR
    <f73>   DW_AT_type        : <0x119c>
    <f77>   DW_AT_decl_file   : 4
    <f78>   DW_AT_decl_line   : 474
    <f7a>   DW_AT_data_member_location: 80
 <2><f7b>: Abbrev Number: 8 (DW_TAG_member)
    <f7c>   DW_AT_name        : (indirect string, offset: 0x178): ID_ISAR
    <f80>   DW_AT_type        : <0x11a8>
    <f84>   DW_AT_decl_file   : 4
    <f85>   DW_AT_decl_line   : 475
    <f87>   DW_AT_data_member_location: 96
 <2><f88>: Abbrev Number: 8 (DW_TAG_member)
    <f89>   DW_AT_name        : (indirect string, offset: 0x180): RESERVED0
    <f8d>   DW_AT_type        : <0x11b4>
    <f91>   DW_AT_decl_file   : 4
    <f92>   DW_AT_decl_line   : 476
    <f94>   DW_AT_data_member_location: 116
 <2><f95>: Abbrev Number: 8 (DW_TAG_member)
    <f96>   DW_AT_name        : (indirect string, offset: 0x18a): CLIDR
    <f9a>   DW_AT_type        : <0x1134>
    <f9e>   DW_AT_decl_file   : 4
    <f9f>   DW_AT_decl_line   : 477
    <fa1>   DW_AT_data_member_location: 120
 <2><fa2>: Abbrev Number: 8 (DW_TAG_member)
    <fa3>   DW_AT_name        : (indirect string, offset: 0x190): CTR
    <fa7>   DW_AT_type        : <0x1134>
    <fab>   DW_AT_decl_file   : 4
    <fac>   DW_AT_decl_line   : 478
    <fae>   DW_AT_data_member_location: 124
 <2><faf>: Abbrev Number: 8 (DW_TAG_member)
    <fb0>   DW_AT_name        : (indirect string, offset: 0x194): CCSIDR
    <fb4>   DW_AT_type        : <0x1134>
    <fb8>   DW_AT_decl_file   : 4
    <fb9>   DW_AT_decl_line   : 479
    <fbb>   DW_AT_data_member_location: 128
 <2><fbc>: Abbrev Number: 8 (DW_TAG_member)
    <fbd>   DW_AT_name        : (indirect string, offset: 0x19b): CSSELR
    <fc1>   DW_AT_type        : <0x1139>
    <fc5>   DW_AT_decl_file   : 4
    <fc6>   DW_AT_decl_line   : 480
    <fc8>   DW_AT_data_member_location: 132
 <2><fc9>: Abbrev Number: 8 (DW_TAG_member)
    <fca>   DW_AT_name        : (indirect string, offset: 0x1a2): CPACR
    <fce>   DW_AT_type        : <0x1139>
    <fd2>   DW_AT_decl_file   : 4
    <fd3>   DW_AT_decl_line   : 481
    <fd5>   DW_AT_data_member_location: 136
 <2><fd6>: Abbrev Number: 8 (DW_TAG_member)
    <fd7>   DW_AT_name        : (indirect string, offset: 0x1a8): RESERVED3
    <fdb>   DW_AT_type        : <0x11c0>
    <fdf>   DW_AT_decl_file   : 4
    <fe0>   DW_AT_decl_line   : 482
    <fe2>   DW_AT_data_member_location: 140
 <2><fe3>: Abbrev Number: 9 (DW_TAG_member)
    <fe4>   DW_AT_name        : (indirect string, offset: 0x1b2): STIR
    <fe8>   DW_AT_type        : <0x1139>
    <fec>   DW_AT_decl_file   : 4
    <fed>   DW_AT_decl_line   : 483
    <fef>   DW_AT_data_member_location: 512
 <2><ff1>: Abbrev Number: 9 (DW_TAG_member)
    <ff2>   DW_AT_name        : (indirect string, offset: 0x1b7): RESERVED4
    <ff6>   DW_AT_type        : <0x11cc>
    <ffa>   DW_AT_decl_file   : 4
    <ffb>   DW_AT_decl_line   : 484
    <ffd>   DW_AT_data_member_location: 516
 <2><fff>: Abbrev Number: 9 (DW_TAG_member)
    <1000>   DW_AT_name        : (indirect string, offset: 0x1c1): MVFR0
    <1004>   DW_AT_type        : <0x1134>
    <1008>   DW_AT_decl_file   : 4
    <1009>   DW_AT_decl_line   : 485
    <100b>   DW_AT_data_member_location: 576
 <2><100d>: Abbrev Number: 9 (DW_TAG_member)
    <100e>   DW_AT_name        : (indirect string, offset: 0x1c7): MVFR1
    <1012>   DW_AT_type        : <0x1134>
    <1016>   DW_AT_decl_file   : 4
    <1017>   DW_AT_decl_line   : 486
    <1019>   DW_AT_data_member_location: 580
 <2><101b>: Abbrev Number: 9 (DW_TAG_member)
    <101c>   DW_AT_name        : (indirect string, offset: 0x1cd): MVFR2
    <1020>   DW_AT_type        : <0x1134>
    <1024>   DW_AT_decl_file   : 4
    <1025>   DW_AT_decl_line   : 487
    <1027>   DW_AT_data_member_location: 584
 <2><1029>: Abbrev Number: 9 (DW_TAG_member)
    <102a>   DW_AT_name        : (indirect string, offset: 0x1d3): RESERVED5
    <102e>   DW_AT_type        : <0x11b4>
    <1032>   DW_AT_decl_file   : 4
    <1033>   DW_AT_decl_line   : 488
    <1035>   DW_AT_data_member_location: 588
 <2><1037>: Abbrev Number: 9 (DW_TAG_member)
    <1038>   DW_AT_name        : (indirect string, offset: 0x1dd): ICIALLU
    <103c>   DW_AT_type        : <0x1139>
    <1040>   DW_AT_decl_file   : 4
    <1041>   DW_AT_decl_line   : 489
    <1043>   DW_AT_data_member_location: 592
 <2><1045>: Abbrev Number: 9 (DW_TAG_member)
    <1046>   DW_AT_name        : (indirect string, offset: 0x1e5): RESERVED6
    <104a>   DW_AT_type        : <0x11b4>
    <104e>   DW_AT_decl_file   : 4
    <104f>   DW_AT_decl_line   : 490
    <1051>   DW_AT_data_member_location: 596
 <2><1053>: Abbrev Number: 9 (DW_TAG_member)
    <1054>   DW_AT_name        : (indirect string, offset: 0x1ef): ICIMVAU
    <1058>   DW_AT_type        : <0x1139>
    <105c>   DW_AT_decl_file   : 4
    <105d>   DW_AT_decl_line   : 491
    <105f>   DW_AT_data_member_location: 600
 <2><1061>: Abbrev Number: 9 (DW_TAG_member)
    <1062>   DW_AT_name        : (indirect string, offset: 0x1f7): DCIMVAC
    <1066>   DW_AT_type        : <0x1139>
    <106a>   DW_AT_decl_file   : 4
    <106b>   DW_AT_decl_line   : 492
    <106d>   DW_AT_data_member_location: 604
 <2><106f>: Abbrev Number: 9 (DW_TAG_member)
    <1070>   DW_AT_name        : (indirect string, offset: 0x1ff): DCISW
    <1074>   DW_AT_type        : <0x1139>
    <1078>   DW_AT_decl_file   : 4
    <1079>   DW_AT_decl_line   : 493
    <107b>   DW_AT_data_member_location: 608
 <2><107d>: Abbrev Number: 9 (DW_TAG_member)
    <107e>   DW_AT_name        : (indirect string, offset: 0x205): DCCMVAU
    <1082>   DW_AT_type        : <0x1139>
    <1086>   DW_AT_decl_file   : 4
    <1087>   DW_AT_decl_line   : 494
    <1089>   DW_AT_data_member_location: 612
 <2><108b>: Abbrev Number: 9 (DW_TAG_member)
    <108c>   DW_AT_name        : (indirect string, offset: 0x20d): DCCMVAC
    <1090>   DW_AT_type        : <0x1139>
    <1094>   DW_AT_decl_file   : 4
    <1095>   DW_AT_decl_line   : 495
    <1097>   DW_AT_data_member_location: 616
 <2><1099>: Abbrev Number: 9 (DW_TAG_member)
    <109a>   DW_AT_name        : (indirect string, offset: 0x215): DCCSW
    <109e>   DW_AT_type        : <0x1139>
    <10a2>   DW_AT_decl_file   : 4
    <10a3>   DW_AT_decl_line   : 496
    <10a5>   DW_AT_data_member_location: 620
 <2><10a7>: Abbrev Number: 9 (DW_TAG_member)
    <10a8>   DW_AT_name        : (indirect string, offset: 0x21b): DCCIMVAC
    <10ac>   DW_AT_type        : <0x1139>
    <10b0>   DW_AT_decl_file   : 4
    <10b1>   DW_AT_decl_line   : 497
    <10b3>   DW_AT_data_member_location: 624
 <2><10b5>: Abbrev Number: 9 (DW_TAG_member)
    <10b6>   DW_AT_name        : (indirect string, offset: 0x224): DCCISW
    <10ba>   DW_AT_type        : <0x1139>
    <10be>   DW_AT_decl_file   : 4
    <10bf>   DW_AT_decl_line   : 498
    <10c1>   DW_AT_data_member_location: 628
 <2><10c3>: Abbrev Number: 9 (DW_TAG_member)
    <10c4>   DW_AT_name        : (indirect string, offset: 0x22b): RESERVED7
    <10c8>   DW_AT_type        : <0x11d8>
    <10cc>   DW_AT_decl_file   : 4
    <10cd>   DW_AT_decl_line   : 499
    <10cf>   DW_AT_data_member_location: 632
 <2><10d1>: Abbrev Number: 9 (DW_TAG_member)
    <10d2>   DW_AT_name        : (indirect string, offset: 0x235): ITCMCR
    <10d6>   DW_AT_type        : <0x1139>
    <10da>   DW_AT_decl_file   : 4
    <10db>   DW_AT_decl_line   : 500
    <10dd>   DW_AT_data_member_location: 656
 <2><10df>: Abbrev Number: 9 (DW_TAG_member)
    <10e0>   DW_AT_name        : (indirect string, offset: 0x23c): DTCMCR
    <10e4>   DW_AT_type        : <0x1139>
    <10e8>   DW_AT_decl_file   : 4
    <10e9>   DW_AT_decl_line   : 501
    <10eb>   DW_AT_data_member_location: 660
 <2><10ed>: Abbrev Number: 9 (DW_TAG_member)
    <10ee>   DW_AT_name        : (indirect string, offset: 0x243): AHBPCR
    <10f2>   DW_AT_type        : <0x1139>
    <10f6>   DW_AT_decl_file   : 4
    <10f7>   DW_AT_decl_line   : 502
    <10f9>   DW_AT_data_member_location: 664
 <2><10fb>: Abbrev Number: 9 (DW_TAG_member)
    <10fc>   DW_AT_name        : (indirect string, offset: 0x24a): CACR
    <1100>   DW_AT_type        : <0x1139>
    <1104>   DW_AT_decl_file   : 4
    <1105>   DW_AT_decl_line   : 503
    <1107>   DW_AT_data_member_location: 668
 <2><1109>: Abbrev Number: 9 (DW_TAG_member)
    <110a>   DW_AT_name        : (indirect string, offset: 0x24f): AHBSCR
    <110e>   DW_AT_type        : <0x1139>
    <1112>   DW_AT_decl_file   : 4
    <1113>   DW_AT_decl_line   : 504
    <1115>   DW_AT_data_member_location: 672
 <2><1117>: Abbrev Number: 9 (DW_TAG_member)
    <1118>   DW_AT_name        : (indirect string, offset: 0x256): RESERVED8
    <111c>   DW_AT_type        : <0x11b4>
    <1120>   DW_AT_decl_file   : 4
    <1121>   DW_AT_decl_line   : 505
    <1123>   DW_AT_data_member_location: 676
 <2><1125>: Abbrev Number: 9 (DW_TAG_member)
    <1126>   DW_AT_name        : (indirect string, offset: 0x260): ABFSR
    <112a>   DW_AT_type        : <0x1139>
    <112e>   DW_AT_decl_file   : 4
    <112f>   DW_AT_decl_line   : 506
    <1131>   DW_AT_data_member_location: 680
 <2><1133>: Abbrev Number: 0
 <1><1134>: Abbrev Number: 10 (DW_TAG_const_type)
    <1135>   DW_AT_type        : <0x1139>
 <1><1139>: Abbrev Number: 11 (DW_TAG_volatile_type)
    <113a>   DW_AT_type        : <0x113e>
 <1><113e>: Abbrev Number: 12 (DW_TAG_typedef)
    <113f>   DW_AT_type        : <0x1149>
    <1143>   DW_AT_name        : (indirect string, offset: 0xce): uint32_t
    <1147>   DW_AT_decl_file   : 3
    <1148>   DW_AT_decl_line   : 48
 <1><1149>: Abbrev Number: 12 (DW_TAG_typedef)
    <114a>   DW_AT_type        : <0x1154>
    <114e>   DW_AT_name        : (indirect string, offset: 0xcc): __uint32_t
    <1152>   DW_AT_decl_file   : 2
    <1153>   DW_AT_decl_line   : 79
 <1><1154>: Abbrev Number: 4 (DW_TAG_base_type)
    <1155>   DW_AT_name        : (indirect string, offset: 0x5813): unsigned int
    <1159>   DW_AT_encoding    : 7	(unsigned)
    <115a>   DW_AT_byte_size   : 4
 <1><115b>: Abbrev Number: 13 (DW_TAG_array_type)
    <115c>   DW_AT_type        : <0x1167>
 <2><1160>: Abbrev Number: 14 (DW_TAG_subrange_type)
    <1161>   DW_AT_type        : <0x1189>
    <1165>   DW_AT_count       : 12
 <2><1166>: Abbrev Number: 0
 <1><1167>: Abbrev Number: 11 (DW_TAG_volatile_type)
    <1168>   DW_AT_type        : <0x116c>
 <1><116c>: Abbrev Number: 12 (DW_TAG_typedef)
    <116d>   DW_AT_type        : <0x1177>
    <1171>   DW_AT_name        : (indirect string, offset: 0x106): uint8_t
    <1175>   DW_AT_decl_file   : 3
    <1176>   DW_AT_decl_line   : 24
 <1><1177>: Abbrev Number: 12 (DW_TAG_typedef)
    <1178>   DW_AT_type        : <0x1182>
    <117c>   DW_AT_name        : (indirect string, offset: 0x104): __uint8_t
    <1180>   DW_AT_decl_file   : 2
